[Killed] BlockStatement
src/services/productService.ts:9:64
 } from "@/types/product";
 import { apiFetch, buildQueryParams } from "./api";
 
-function normalizeProductFilters(filters: ProductFilters = {}) {
-  return {
-    search: filters.search,
-    categoryGroup: filters.categoryGroup,
-    category: filters.category,
-    brand: filters.brand,
-    minPrice: filters.minPrice,
-    maxPrice: filters.maxPrice,
-    available: filters.available,
-    active: filters.active,
-    sort: filters.sort ?? "newest",
-  };
-}
+function normalizeProductFilters(filters: ProductFilters = {}) {}
 
 export const productService = {
killedBy: productService lista produtos públicos com filtros
statusReason: Cannot read properties of undefined (reading 'search')

[Killed] LogicalOperator
src/services/productService.ts:19:11
     maxPrice: filters.maxPrice,
     available: filters.available,
     active: filters.active,
-    sort: filters.sort ?? "newest",
+    sort: filters.sort && "newest",
   };
 }
killedBy: productService lista produtos públicos com filtros
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/products?search=notebook&categoryGroup=Computadores+e+Mobile&available=true&sort=price_asc",

[Killed] BlockStatement
src/services/productService.ts:24:75
 }
 
 export const productService = {
-  async findAll(filters: ProductFilters = {}): Promise<ProductResponse[]> {
-    const normalizedFilters = normalizeProductFilters(filters);
-
-    const query = buildQueryParams({
-      search: normalizedFilters.search,
-      categoryGroup: normalizedFilters.categoryGroup,
-      category: normalizedFilters.category,
-      brand: normalizedFilters.brand,
-      minPrice: normalizedFilters.minPrice,
-      maxPrice: normalizedFilters.maxPrice,
-      available: normalizedFilters.available,
-      sort: normalizedFilters.sort,
-    });
-
-    return apiFetch<ProductResponse[]>(`/products${query}`, {
-      method: "GET",
-      auth: false,
-    });
-  },
+  async findAll(filters: ProductFilters = {}): Promise<ProductResponse[]> {},
 
   async findAllForAdmin(
killedBy: productService lista produtos públicos com filtros
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BooleanLiteral
src/services/productService.ts:40:13
 
     return apiFetch<ProductResponse[]>(`/products${query}`, {
       method: "GET",
-      auth: false,
+      auth: true,
     });
   },
killedBy: productService lista produtos públicos com filtros
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "/products?search=notebook&categoryGroup=Computadores+e+Mobile&available=true&sort=price_asc",

[Killed] BlockStatement
src/services/productService.ts:46:33
 
   async findAllForAdmin(
     filters: ProductFilters = {}
-  ): Promise<ProductResponse[]> {
-    const normalizedFilters = normalizeProductFilters(filters);
-
-    const query = buildQueryParams({
-      search: normalizedFilters.search,
-      categoryGroup: normalizedFilters.categoryGroup,
-      category: normalizedFilters.category,
-      brand: normalizedFilters.brand,
-      active: normalizedFilters.active,
-      minPrice: normalizedFilters.minPrice,
-      maxPrice: normalizedFilters.maxPrice,
-      available: normalizedFilters.available,
-      sort: normalizedFilters.sort,
-    });
-
-    return apiFetch<ProductResponse[]>(`/products/admin${query}`, {
-      method: "GET",
-    });
-  },
+  ): Promise<ProductResponse[]> {},
 
   async findById(id: number): Promise<ProductResponse> {
killedBy: productService lista produtos admin com filtros
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ObjectLiteral
src/services/productService.ts:49:36
   ): Promise<ProductResponse[]> {
     const normalizedFilters = normalizeProductFilters(filters);
 
-    const query = buildQueryParams({
-      search: normalizedFilters.search,
-      categoryGroup: normalizedFilters.categoryGroup,
-      category: normalizedFilters.category,
-      brand: normalizedFilters.brand,
-      active: normalizedFilters.active,
-      minPrice: normalizedFilters.minPrice,
-      maxPrice: normalizedFilters.maxPrice,
-      available: normalizedFilters.available,
-      sort: normalizedFilters.sort,
-    });
+    const query = buildQueryParams({});
 
     return apiFetch<ProductResponse[]>(`/products/admin${query}`, {
killedBy: productService lista produtos admin com filtros
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/products/admin?active=false&sort=name_asc",

[Killed] StringLiteral
src/services/productService.ts:62:15
     });
 
     return apiFetch<ProductResponse[]>(`/products/admin${query}`, {
-      method: "GET",
+      method: "",
     });
   },
killedBy: productService lista produtos admin com filtros
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "/products/admin?active=false&sort=name_asc",

[Killed] BlockStatement
src/services/productService.ts:66:56
     });
   },
 
-  async findById(id: number): Promise<ProductResponse> {
-    return apiFetch<ProductResponse>(`/products/${id}`, {
-      method: "GET",
-      auth: false,
-    });
-  },
+  async findById(id: number): Promise<ProductResponse> {},
 
   async findByIdForAdmin(id: number): Promise<ProductResponse> {
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/1",

[Killed] BlockStatement
src/services/productService.ts:73:64
     });
   },
 
-  async findByIdForAdmin(id: number): Promise<ProductResponse> {
-    return apiFetch<ProductResponse>(`/products/admin/${id}`, {
-      method: "GET",
-    });
-  },
+  async findByIdForAdmin(id: number): Promise<ProductResponse> {},
 
   async findRelated(id: number): Promise<ProductResponse[]> {
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/admin/1', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/admin/1",

[Killed] BlockStatement
src/services/productService.ts:79:61
     });
   },
 
-  async findRelated(id: number): Promise<ProductResponse[]> {
-    return apiFetch<ProductResponse[]>(`/products/${id}/related`, {
-      method: "GET",
-      auth: false,
-    });
-  },
+  async findRelated(id: number): Promise<ProductResponse[]> {},
 
   async findCategories(): Promise<string[]> {
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1/related', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/1/related",

[Killed] ObjectLiteral
src/services/productService.ts:80:67
   },
 
   async findRelated(id: number): Promise<ProductResponse[]> {
-    return apiFetch<ProductResponse[]>(`/products/${id}/related`, {
-      method: "GET",
-      auth: false,
-    });
+    return apiFetch<ProductResponse[]>(`/products/${id}/related`, {});
   },
 
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1/related', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/1/related",

[Killed] StringLiteral
src/services/productService.ts:81:15
 
   async findRelated(id: number): Promise<ProductResponse[]> {
     return apiFetch<ProductResponse[]>(`/products/${id}/related`, {
-      method: "GET",
+      method: "",
       auth: false,
     });
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1/related', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/1/related",

[Killed] BlockStatement
src/services/productService.ts:86:45
     });
   },
 
-  async findCategories(): Promise<string[]> {
-    return apiFetch<string[]>("/products/categories", {
-      method: "GET",
-      auth: false,
-    });
-  },
+  async findCategories(): Promise<string[]> {},
 
   async findAllCategoriesForAdmin(): Promise<string[]> {
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/categories', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/categories",

[Killed] ObjectLiteral
src/services/productService.ts:87:55
   },
 
   async findCategories(): Promise<string[]> {
-    return apiFetch<string[]>("/products/categories", {
-      method: "GET",
-      auth: false,
-    });
+    return apiFetch<string[]>("/products/categories", {});
   },
 
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/categories', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/categories",

[Killed] StringLiteral
src/services/productService.ts:88:15
 
   async findCategories(): Promise<string[]> {
     return apiFetch<string[]>("/products/categories", {
-      method: "GET",
+      method: "",
       auth: false,
     });
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/categories', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/categories",

[Killed] BlockStatement
src/services/productService.ts:93:56
     });
   },
 
-  async findAllCategoriesForAdmin(): Promise<string[]> {
-    return apiFetch<string[]>("/products/admin/categories", {
-      method: "GET",
-    });
-  },
+  async findAllCategoriesForAdmin(): Promise<string[]> {},
 
   async findBrands(): Promise<string[]> {
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/admin/categories', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/admin/categories",

[Killed] StringLiteral
src/services/productService.ts:94:31
   },
 
   async findAllCategoriesForAdmin(): Promise<string[]> {
-    return apiFetch<string[]>("/products/admin/categories", {
+    return apiFetch<string[]>("", {
       method: "GET",
     });
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/admin/categories', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/admin/categories",

[Killed] StringLiteral
src/services/productService.ts:95:15
 
   async findAllCategoriesForAdmin(): Promise<string[]> {
     return apiFetch<string[]>("/products/admin/categories", {
-      method: "GET",
+      method: "",
     });
   },
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/admin/categories', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/admin/categories",

[Killed] BlockStatement
src/services/productService.ts:99:41
     });
   },
 
-  async findBrands(): Promise<string[]> {
-    return apiFetch<string[]>("/products/brands", {
-      method: "GET",
-      auth: false,
-    });
-  },
+  async findBrands(): Promise<string[]> {},
 
   async create(request: CreateProductRequest): Promise<ProductResponse> {
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/brands', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/brands",

[Killed] StringLiteral
src/services/productService.ts:100:31
   },
 
   async findBrands(): Promise<string[]> {
-    return apiFetch<string[]>("/products/brands", {
+    return apiFetch<string[]>("", {
       method: "GET",
       auth: false,
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/brands', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/brands",

[Killed] StringLiteral
src/services/productService.ts:101:15
 
   async findBrands(): Promise<string[]> {
     return apiFetch<string[]>("/products/brands", {
-      method: "GET",
+      method: "",
       auth: false,
     });
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/brands', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/brands",

[Killed] BlockStatement
src/services/productService.ts:106:73
     });
   },
 
-  async create(request: CreateProductRequest): Promise<ProductResponse> {
-    return apiFetch<ProductResponse>("/products", {
-      method: "POST",
-      body: request,
-    });
-  },
+  async create(request: CreateProductRequest): Promise<ProductResponse> {},
 
   async update(
killedBy: productService cria, atualiza, ativa, desativa e remove produto
statusReason: expected "vi.fn()" to be called with arguments: [ '/products', …(1) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] ObjectLiteral
src/services/productService.ts:107:51
   },
 
   async create(request: CreateProductRequest): Promise<ProductResponse> {
-    return apiFetch<ProductResponse>("/products", {
-      method: "POST",
-      body: request,
-    });
+    return apiFetch<ProductResponse>("/products", {});
   },
 
killedBy: productService cria, atualiza, ativa, desativa e remove produto
statusReason: expected "vi.fn()" to be called with arguments: [ '/products', …(1) ]

Received:

  1st vi.fn() call:

  [
    "/products",

[Killed] BlockStatement
src/services/productService.ts:116:31
   async update(
     id: number,
     request: UpdateProductRequest
-  ): Promise<ProductResponse> {
-    return apiFetch<ProductResponse>(`/products/${id}`, {
-      method: "PUT",
-      body: request,
-    });
-  },
+  ): Promise<ProductResponse> {},
 
   async activate(id: number): Promise<ProductResponse> {
killedBy: productService cria, atualiza, ativa, desativa e remove produto
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1', …(1) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] BlockStatement
src/services/productService.ts:123:56
     });
   },
 
-  async activate(id: number): Promise<ProductResponse> {
-    return apiFetch<ProductResponse>(`/products/${id}/activate`, {
-      method: "PATCH",
-    });
-  },
+  async activate(id: number): Promise<ProductResponse> {},
 
   async deactivate(id: number): Promise<ProductResponse> {
killedBy: productService cria, atualiza, ativa, desativa e remove produto
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1/activate', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/1/activate",

[Killed] ObjectLiteral
src/services/productService.ts:124:66
   },
 
   async activate(id: number): Promise<ProductResponse> {
-    return apiFetch<ProductResponse>(`/products/${id}/activate`, {
-      method: "PATCH",
-    });
+    return apiFetch<ProductResponse>(`/products/${id}/activate`, {});
   },
 
killedBy: productService cria, atualiza, ativa, desativa e remove produto
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1/activate', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/1/activate",

[Killed] BlockStatement
src/services/productService.ts:129:58
     });
   },
 
-  async deactivate(id: number): Promise<ProductResponse> {
-    return apiFetch<ProductResponse>(`/products/${id}/deactivate`, {
-      method: "PATCH",
-    });
-  },
+  async deactivate(id: number): Promise<ProductResponse> {},
 
   async delete(id: number): Promise<void> {
killedBy: productService cria, atualiza, ativa, desativa e remove produto
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1/deactivate', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/1/deactivate",

[Killed] StringLiteral
src/services/productService.ts:130:38
   },
 
   async deactivate(id: number): Promise<ProductResponse> {
-    return apiFetch<ProductResponse>(`/products/${id}/deactivate`, {
+    return apiFetch<ProductResponse>(``, {
       method: "PATCH",
     });
killedBy: productService cria, atualiza, ativa, desativa e remove produto
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1/deactivate', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/1/deactivate",

[Killed] BlockStatement
src/services/productService.ts:135:43
     });
   },
 
-  async delete(id: number): Promise<void> {
-    return apiFetch<void>(`/products/${id}`, {
-      method: "DELETE",
-    });
-  },
+  async delete(id: number): Promise<void> {},
 
   async findCategoryGroups(): Promise<string[]> {
killedBy: productService cria, atualiza, ativa, desativa e remove produto
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1', { method: 'DELETE' } ]

Received:

  1st vi.fn() call:

  [
-   "/products/1",

[Killed] ObjectLiteral
src/services/productService.ts:136:46
   },
 
   async delete(id: number): Promise<void> {
-    return apiFetch<void>(`/products/${id}`, {
-      method: "DELETE",
-    });
+    return apiFetch<void>(`/products/${id}`, {});
   },
 
killedBy: productService cria, atualiza, ativa, desativa e remove produto
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/1', { method: 'DELETE' } ]

Received:

  1st vi.fn() call:

  [
-   "/products/1",

[Killed] BlockStatement
src/services/productService.ts:141:49
     });
   },
 
-  async findCategoryGroups(): Promise<string[]> {
-    return apiFetch<string[]>("/products/category-groups", {
-      method: "GET",
-      auth: false,
-    });
-  },
+  async findCategoryGroups(): Promise<string[]> {},
 
   async findAllCategoryGroupsForAdmin(): Promise<string[]> {
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ '/products/category-groups', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/products/category-groups",

[Killed] BlockStatement
src/services/productService.ts:148:60
     });
   },
 
-  async findAllCategoryGroupsForAdmin(): Promise<string[]> {
-    return apiFetch<string[]>("/products/admin/category-groups", {
-      method: "GET",
-    });
-  },
+  async findAllCategoryGroupsForAdmin(): Promise<string[]> {},
 };
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/products/admin/category-groups",

[Killed] ObjectLiteral
src/services/productService.ts:149:66
   },
 
   async findAllCategoryGroupsForAdmin(): Promise<string[]> {
-    return apiFetch<string[]>("/products/admin/category-groups", {
-      method: "GET",
-    });
+    return apiFetch<string[]>("/products/admin/category-groups", {});
   },
 };
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/products/admin/category-groups",

[Killed] StringLiteral
src/services/productService.ts:149:31
   },
 
   async findAllCategoryGroupsForAdmin(): Promise<string[]> {
-    return apiFetch<string[]>("/products/admin/category-groups", {
+    return apiFetch<string[]>("", {
       method: "GET",
     });
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/products/admin/category-groups",

[Killed] StringLiteral
src/services/productService.ts:150:15
 
   async findAllCategoryGroupsForAdmin(): Promise<string[]> {
     return apiFetch<string[]>("/products/admin/category-groups", {
-      method: "GET",
+      method: "",
     });
   },
killedBy: productService busca produto, relacionados, categorias, grupos e marcas
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/products/admin/category-groups",
