[Killed] LogicalOperator
src/services/api.ts:5:3
 import type { AuthenticatedUserResponse, LoginResponse } from "@/types/auth";
 
 export const API_BASE_URL =
-  process.env.NEXT_PUBLIC_API_URL?.replace(/\/$/, "") ?? "http://localhost:8080";
+  process.env.NEXT_PUBLIC_API_URL?.replace(/\/$/, "") && "http://localhost:8080";
 
 export const TOKEN_KEY = "pointclick_token";
killedBy: api monta URL da API
statusReason: expected 'undefined/products' to be 'http://localhost:8080/products' // Object.is equality

[Survived] OptionalChaining
src/services/api.ts:5:3
 import type { AuthenticatedUserResponse, LoginResponse } from "@/types/auth";
 
 export const API_BASE_URL =
-  process.env.NEXT_PUBLIC_API_URL?.replace(/\/$/, "") ?? "http://localhost:8080";
+  process.env.NEXT_PUBLIC_API_URL.replace(/\/$/, "") ?? "http://localhost:8080";
 
 export const TOKEN_KEY = "pointclick_token";

[Killed] BlockStatement
src/services/api.ts:26:48
   instance?: string;
   data?: unknown;
 
-  constructor(error: ApiError, data?: unknown) {
-    super(error.detail || error.title || "Erro ao comunicar com a API");
-    this.name = "ApiRequestError";
-    this.status = error.status;
-    this.title = error.title;
-    this.detail = error.detail;
-    this.instance = error.instance;
-    this.data = data;
-  }
+  constructor(error: ApiError, data?: unknown) {}
 }
 
killedBy: api lança ApiRequestError para resposta de erro
statusReason: expected ReferenceError: Must call super construct… to be an instance of ApiRequestError

[Survived] LogicalOperator
src/services/api.ts:27:11
   data?: unknown;
 
   constructor(error: ApiError, data?: unknown) {
-    super(error.detail || error.title || "Erro ao comunicar com a API");
+    super(error.detail && error.title || "Erro ao comunicar com a API");
     this.name = "ApiRequestError";
     this.status = error.status;

[Survived] ConditionalExpression
src/services/api.ts:27:11
   data?: unknown;
 
   constructor(error: ApiError, data?: unknown) {
-    super(error.detail || error.title || "Erro ao comunicar com a API");
+    super(true);
     this.name = "ApiRequestError";
     this.status = error.status;

[Killed] BlockStatement
src/services/api.ts:39:49
 
 let refreshPromise: Promise<LoginResponse | null> | null = null;
 
-export function getAccessToken(): string | null {
-  if (typeof window === "undefined") return null;
-  return localStorage.getItem(TOKEN_KEY);
-}
+export function getAccessToken(): string | null {}
 
 export function getRefreshToken(): string | null {
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected undefined to be 'access-token' // Object.is equality

[Killed] EqualityOperator
src/services/api.ts:40:7
 let refreshPromise: Promise<LoginResponse | null> | null = null;
 
 export function getAccessToken(): string | null {
-  if (typeof window === "undefined") return null;
+  if (typeof window !== "undefined") return null;
   return localStorage.getItem(TOKEN_KEY);
 }
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to be 'access-token' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:40:7
 let refreshPromise: Promise<LoginResponse | null> | null = null;
 
 export function getAccessToken(): string | null {
-  if (typeof window === "undefined") return null;
+  if (true) return null;
   return localStorage.getItem(TOKEN_KEY);
 }
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to be 'access-token' // Object.is equality

[Killed] BlockStatement
src/services/api.ts:44:50
   return localStorage.getItem(TOKEN_KEY);
 }
 
-export function getRefreshToken(): string | null {
-  if (typeof window === "undefined") return null;
-  return localStorage.getItem(REFRESH_TOKEN_KEY);
-}
+export function getRefreshToken(): string | null {}
 
 export function getStoredUser(): AuthenticatedUserResponse | null {
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected undefined to be 'refresh-token' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:45:7
 }
 
 export function getRefreshToken(): string | null {
-  if (typeof window === "undefined") return null;
+  if (true) return null;
   return localStorage.getItem(REFRESH_TOKEN_KEY);
 }
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to be 'refresh-token' // Object.is equality

[Killed] EqualityOperator
src/services/api.ts:45:7
 }
 
 export function getRefreshToken(): string | null {
-  if (typeof window === "undefined") return null;
+  if (typeof window !== "undefined") return null;
   return localStorage.getItem(REFRESH_TOKEN_KEY);
 }
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to be 'refresh-token' // Object.is equality

[Killed] BlockStatement
src/services/api.ts:49:67
   return localStorage.getItem(REFRESH_TOKEN_KEY);
 }
 
-export function getStoredUser(): AuthenticatedUserResponse | null {
-  if (typeof window === "undefined") return null;
-
-  const rawUser = localStorage.getItem(AUTH_USER_KEY);
-
-  if (!rawUser) return null;
-
-  try {
-    return JSON.parse(rawUser) as AuthenticatedUserResponse;
-  } catch {
-    return null;
-  }
-}
+export function getStoredUser(): AuthenticatedUserResponse | null {}
 
 export function saveAuthData(response: LoginResponse): void {
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected undefined to deeply equal { id: 1, …(3) }

[Killed] EqualityOperator
src/services/api.ts:50:7
 }
 
 export function getStoredUser(): AuthenticatedUserResponse | null {
-  if (typeof window === "undefined") return null;
+  if (typeof window !== "undefined") return null;
 
   const rawUser = localStorage.getItem(AUTH_USER_KEY);
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to deeply equal { id: 1, …(3) }

[Killed] ConditionalExpression
src/services/api.ts:50:7
 }
 
 export function getStoredUser(): AuthenticatedUserResponse | null {
-  if (typeof window === "undefined") return null;
+  if (true) return null;
 
   const rawUser = localStorage.getItem(AUTH_USER_KEY);
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to deeply equal { id: 1, …(3) }

[Killed] ConditionalExpression
src/services/api.ts:54:7
 
   const rawUser = localStorage.getItem(AUTH_USER_KEY);
 
-  if (!rawUser) return null;
+  if (true) return null;
 
   try {
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to deeply equal { id: 1, …(3) }

[Killed] BooleanLiteral
src/services/api.ts:54:7
 
   const rawUser = localStorage.getItem(AUTH_USER_KEY);
 
-  if (!rawUser) return null;
+  if (rawUser) return null;
 
   try {
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to deeply equal { id: 1, …(3) }

[Killed] BlockStatement
src/services/api.ts:56:7
 
   if (!rawUser) return null;
 
-  try {
-    return JSON.parse(rawUser) as AuthenticatedUserResponse;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected undefined to deeply equal { id: 1, …(3) }

[NoCoverage] BlockStatement
src/services/api.ts:58:11
 
   try {
     return JSON.parse(rawUser) as AuthenticatedUserResponse;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/services/api.ts:63:61
   }
 }
 
-export function saveAuthData(response: LoginResponse): void {
-  if (typeof window === "undefined") return;
-
-  localStorage.setItem(TOKEN_KEY, response.token);
-  localStorage.setItem(REFRESH_TOKEN_KEY, response.refreshToken);
-  localStorage.setItem(TOKEN_TYPE_KEY, response.type);
-  localStorage.setItem(TOKEN_EXPIRES_IN_KEY, String(response.expiresIn));
-  localStorage.setItem(AUTH_USER_KEY, JSON.stringify(response.user));
-
-  window.dispatchEvent(new Event("pointclick-auth-changed"));
-}
+export function saveAuthData(response: LoginResponse): void {}
 
 export function clearAuthData(): void {
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to be 'access-token' // Object.is equality

[Killed] EqualityOperator
src/services/api.ts:64:7
 }
 
 export function saveAuthData(response: LoginResponse): void {
-  if (typeof window === "undefined") return;
+  if (typeof window !== "undefined") return;
 
   localStorage.setItem(TOKEN_KEY, response.token);
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to be 'access-token' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:64:7
 }
 
 export function saveAuthData(response: LoginResponse): void {
-  if (typeof window === "undefined") return;
+  if (true) return;
 
   localStorage.setItem(TOKEN_KEY, response.token);
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected null to be 'access-token' // Object.is equality

[Survived] StringLiteral
src/services/api.ts:72:34
   localStorage.setItem(TOKEN_EXPIRES_IN_KEY, String(response.expiresIn));
   localStorage.setItem(AUTH_USER_KEY, JSON.stringify(response.user));
 
-  window.dispatchEvent(new Event("pointclick-auth-changed"));
+  window.dispatchEvent(new Event(""));
 }
 

[Killed] BlockStatement
src/services/api.ts:75:39
   window.dispatchEvent(new Event("pointclick-auth-changed"));
 }
 
-export function clearAuthData(): void {
-  if (typeof window === "undefined") return;
-
-  localStorage.removeItem(TOKEN_KEY);
-  localStorage.removeItem(REFRESH_TOKEN_KEY);
-  localStorage.removeItem(TOKEN_TYPE_KEY);
-  localStorage.removeItem(TOKEN_EXPIRES_IN_KEY);
-  localStorage.removeItem(AUTH_USER_KEY);
-
-  window.dispatchEvent(new Event("pointclick-auth-changed"));
-}
+export function clearAuthData(): void {}
 
 export function buildApiUrl(path: string): string {
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected 'access-token' to be null

[Killed] EqualityOperator
src/services/api.ts:76:7
 }
 
 export function clearAuthData(): void {
-  if (typeof window === "undefined") return;
+  if (typeof window !== "undefined") return;
 
   localStorage.removeItem(TOKEN_KEY);
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected 'access-token' to be null

[Killed] ConditionalExpression
src/services/api.ts:76:7
 }
 
 export function clearAuthData(): void {
-  if (typeof window === "undefined") return;
+  if (true) return;
 
   localStorage.removeItem(TOKEN_KEY);
killedBy: api salva, recupera e limpa dados de autenticação
statusReason: expected 'access-token' to be null

[Killed] BlockStatement
src/services/api.ts:87:51
   window.dispatchEvent(new Event("pointclick-auth-changed"));
 }
 
-export function buildApiUrl(path: string): string {
-  if (path.startsWith("http://") || path.startsWith("https://")) {
-    return path;
-  }
-
-  return `${API_BASE_URL}${path.startsWith("/") ? path : `/${path}`}`;
-}
+export function buildApiUrl(path: string): string {}
 
 export function buildPublicFileUrl(url: string | null | undefined): string | null {
killedBy: api monta URL da API
statusReason: expected undefined to be 'http://localhost:8080/products' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:88:7
 }
 
 export function buildApiUrl(path: string): string {
-  if (path.startsWith("http://") || path.startsWith("https://")) {
+  if (true) {
     return path;
   }
killedBy: api monta URL da API
statusReason: expected '/products' to be 'http://localhost:8080/products' // Object.is equality

[Killed] BlockStatement
src/services/api.ts:88:66
 }
 
 export function buildApiUrl(path: string): string {
-  if (path.startsWith("http://") || path.startsWith("https://")) {
-    return path;
-  }
+  if (path.startsWith("http://") || path.startsWith("https://")) {}
 
   return `${API_BASE_URL}${path.startsWith("/") ? path : `/${path}`}`;
killedBy: api monta URL da API
statusReason: expected 'http://localhost:8080/https://api.exe…' to be 'https://api.exemplo.com/products' // Object.is equality

[Killed] MethodExpression
src/services/api.ts:92:28
     return path;
   }
 
-  return `${API_BASE_URL}${path.startsWith("/") ? path : `/${path}`}`;
+  return `${API_BASE_URL}${path.endsWith("/") ? path : `/${path}`}`;
 }
 
killedBy: api monta URL da API
statusReason: expected 'http://localhost:8080//products' to be 'http://localhost:8080/products' // Object.is equality

[Killed] StringLiteral
src/services/api.ts:92:44
     return path;
   }
 
-  return `${API_BASE_URL}${path.startsWith("/") ? path : `/${path}`}`;
+  return `${API_BASE_URL}${path.startsWith("") ? path : `/${path}`}`;
 }
 
killedBy: api monta URL da API
statusReason: expected 'http://localhost:8080products' to be 'http://localhost:8080/products' // Object.is equality

[Killed] BlockStatement
src/services/api.ts:95:83
   return `${API_BASE_URL}${path.startsWith("/") ? path : `/${path}`}`;
 }
 
-export function buildPublicFileUrl(url: string | null | undefined): string | null {
-  if (!url) return null;
-
-  if (url.startsWith("http://") || url.startsWith("https://")) {
-    return url;
-  }
-
-  return buildApiUrl(url);
-}
+export function buildPublicFileUrl(url: string | null | undefined): string | null {}
 
 export function buildQueryParams(params: Record<string, unknown>): string {
killedBy: api monta URL pública de arquivo
statusReason: expected undefined to be 'http://localhost:8080/uploads/image.p…' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:96:7
 }
 
 export function buildPublicFileUrl(url: string | null | undefined): string | null {
-  if (!url) return null;
+  if (true) return null;
 
   if (url.startsWith("http://") || url.startsWith("https://")) {
killedBy: api monta URL pública de arquivo
statusReason: expected null to be 'http://localhost:8080/uploads/image.p…' // Object.is equality

[Killed] BooleanLiteral
src/services/api.ts:96:7
 }
 
 export function buildPublicFileUrl(url: string | null | undefined): string | null {
-  if (!url) return null;
+  if (url) return null;
 
   if (url.startsWith("http://") || url.startsWith("https://")) {
killedBy: api monta URL pública de arquivo
statusReason: expected null to be 'http://localhost:8080/uploads/image.p…' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:98:7
 export function buildPublicFileUrl(url: string | null | undefined): string | null {
   if (!url) return null;
 
-  if (url.startsWith("http://") || url.startsWith("https://")) {
+  if (true) {
     return url;
   }
killedBy: api monta URL pública de arquivo
statusReason: expected '/uploads/image.png' to be 'http://localhost:8080/uploads/image.p…' // Object.is equality

[Survived] MethodExpression
src/services/api.ts:98:36
 export function buildPublicFileUrl(url: string | null | undefined): string | null {
   if (!url) return null;
 
-  if (url.startsWith("http://") || url.startsWith("https://")) {
+  if (url.startsWith("http://") || url.endsWith("https://")) {
     return url;
   }

[Killed] BlockStatement
src/services/api.ts:105:75
   return buildApiUrl(url);
 }
 
-export function buildQueryParams(params: Record<string, unknown>): string {
-  const searchParams = new URLSearchParams();
-
-  Object.entries(params).forEach(([key, value]) => {
-    if (value === undefined || value === null || value === "") {
-      return;
-    }
-
-    searchParams.append(key, String(value));
-  });
-
-  const query = searchParams.toString();
-
-  return query ? `?${query}` : "";
-}
+export function buildQueryParams(params: Record<string, unknown>): string {}
 
 export async function apiFetch<T>(
killedBy: api monta query params ignorando valores vazios
statusReason: expected undefined to be '?search=notebook&available=true' // Object.is equality

[Killed] BlockStatement
src/services/api.ts:108:52
 export function buildQueryParams(params: Record<string, unknown>): string {
   const searchParams = new URLSearchParams();
 
-  Object.entries(params).forEach(([key, value]) => {
-    if (value === undefined || value === null || value === "") {
-      return;
-    }
-
-    searchParams.append(key, String(value));
-  });
+  Object.entries(params).forEach(([key, value]) => {});
 
   const query = searchParams.toString();
killedBy: api monta query params ignorando valores vazios
statusReason: expected '' to be '?search=notebook&available=true' // Object.is equality

[Killed] EqualityOperator
src/services/api.ts:109:50
   const searchParams = new URLSearchParams();
 
   Object.entries(params).forEach(([key, value]) => {
-    if (value === undefined || value === null || value === "") {
+    if (value === undefined || value === null || value !== "") {
       return;
     }
killedBy: api monta query params ignorando valores vazios
statusReason: expected '?empty=' to be '?search=notebook&available=true' // Object.is equality

[Killed] ConditionalExpression
src/services/api.ts:109:32
   const searchParams = new URLSearchParams();
 
   Object.entries(params).forEach(([key, value]) => {
-    if (value === undefined || value === null || value === "") {
+    if (value === undefined || false || value === "") {
       return;
     }
killedBy: api monta query params ignorando valores vazios
statusReason: expected '?search=notebook&nullish=null&availab…' to be '?search=notebook&available=true' // Object.is equality

[Killed] BooleanLiteral
src/services/api.ts:128:12
   const {
     body,
     headers,
-    auth = true,
+    auth = false,
     retry = true,
     ...fetchOptions
killedBy: api adiciona Authorization quando existe token
statusReason: expected null to be 'Bearer access-token' // Object.is equality

[Survived] BooleanLiteral
src/services/api.ts:129:13
     body,
     headers,
     auth = true,
-    retry = true,
+    retry = false,
     ...fetchOptions
   } = options;

[Survived] ConditionalExpression
src/services/api.ts:136:5
   const requestHeaders = new Headers(headers);
 
   const isFormData =
-    typeof FormData !== "undefined" && body instanceof FormData;
+    true;
 
   if (!isFormData && body !== undefined && !requestHeaders.has("Content-Type")) {

[Survived] ConditionalExpression
src/services/api.ts:136:5
   const requestHeaders = new Headers(headers);
 
   const isFormData =
-    typeof FormData !== "undefined" && body instanceof FormData;
+    true && body instanceof FormData;
 
   if (!isFormData && body !== undefined && !requestHeaders.has("Content-Type")) {

[Survived] BooleanLiteral
src/services/api.ts:138:7
   const isFormData =
     typeof FormData !== "undefined" && body instanceof FormData;
 
-  if (!isFormData && body !== undefined && !requestHeaders.has("Content-Type")) {
+  if (isFormData && body !== undefined && !requestHeaders.has("Content-Type")) {
     requestHeaders.set("Content-Type", "application/json");
   }

[Survived] LogicalOperator
src/services/api.ts:138:7
   const isFormData =
     typeof FormData !== "undefined" && body instanceof FormData;
 
-  if (!isFormData && body !== undefined && !requestHeaders.has("Content-Type")) {
+  if (!isFormData && body !== undefined || !requestHeaders.has("Content-Type")) {
     requestHeaders.set("Content-Type", "application/json");
   }

[Survived] ConditionalExpression
src/services/api.ts:142:7
     requestHeaders.set("Content-Type", "application/json");
   }
 
-  if (!requestHeaders.has("Accept")) {
+  if (false) {
     requestHeaders.set("Accept", "application/json");
   }

[Survived] BlockStatement
src/services/api.ts:142:38
     requestHeaders.set("Content-Type", "application/json");
   }
 
-  if (!requestHeaders.has("Accept")) {
-    requestHeaders.set("Accept", "application/json");
-  }
+  if (!requestHeaders.has("Accept")) {}
 
   if (auth) {

[Killed] ConditionalExpression
src/services/api.ts:146:7
     requestHeaders.set("Accept", "application/json");
   }
 
-  if (auth) {
+  if (false) {
     const token = getAccessToken();
 
killedBy: api adiciona Authorization quando existe token
statusReason: expected null to be 'Bearer access-token' // Object.is equality

[Killed] BlockStatement
src/services/api.ts:146:13
     requestHeaders.set("Accept", "application/json");
   }
 
-  if (auth) {
-    const token = getAccessToken();
-
-    if (token) {
-      requestHeaders.set("Authorization", `Bearer ${token}`);
-    }
-  }
+  if (auth) {}
 
   const response = await fetch(buildApiUrl(path), {
killedBy: api adiciona Authorization quando existe token
statusReason: expected null to be 'Bearer access-token' // Object.is equality

[Killed] BlockStatement
src/services/api.ts:149:16
   if (auth) {
     const token = getAccessToken();
 
-    if (token) {
-      requestHeaders.set("Authorization", `Bearer ${token}`);
-    }
+    if (token) {}
   }
 
killedBy: api adiciona Authorization quando existe token
statusReason: expected null to be 'Bearer access-token' // Object.is equality

[Killed] StringLiteral
src/services/api.ts:150:43
     const token = getAccessToken();
 
     if (token) {
-      requestHeaders.set("Authorization", `Bearer ${token}`);
+      requestHeaders.set("Authorization", ``);
     }
   }
killedBy: api adiciona Authorization quando existe token
statusReason: expected '' to be 'Bearer access-token' // Object.is equality

[Survived] LogicalOperator
src/services/api.ts:160:7
     body: normalizeBody(body),
   });
 
-  if (response.status === 401 && auth && retry) {
+  if (response.status === 401 && auth || retry) {
     const refreshed = await refreshAccessToken();
 

[Survived] LogicalOperator
src/services/api.ts:160:7
     body: normalizeBody(body),
   });
 
-  if (response.status === 401 && auth && retry) {
+  if (response.status === 401 || auth && retry) {
     const refreshed = await refreshAccessToken();
 

[NoCoverage] BlockStatement
src/services/api.ts:163:20
   if (response.status === 401 && auth && retry) {
     const refreshed = await refreshAccessToken();
 
-    if (refreshed) {
-      return apiFetch<T>(path, {
-        body,
-        headers,
-        auth,
-        retry: false,
-        ...fetchOptions,
-      });
-    }
+    if (refreshed) {}
   }
 

[NoCoverage] ConditionalExpression
src/services/api.ts:163:9
   if (response.status === 401 && auth && retry) {
     const refreshed = await refreshAccessToken();
 
-    if (refreshed) {
+    if (true) {
       return apiFetch<T>(path, {
         body,

[NoCoverage] ObjectLiteral
src/services/api.ts:164:32
     const refreshed = await refreshAccessToken();
 
     if (refreshed) {
-      return apiFetch<T>(path, {
-        body,
-        headers,
-        auth,
-        retry: false,
-        ...fetchOptions,
-      });
+      return apiFetch<T>(path, {});
     }
   }

[NoCoverage] BooleanLiteral
src/services/api.ts:168:16
         body,
         headers,
         auth,
-        retry: false,
+        retry: true,
         ...fetchOptions,
       });

[Killed] ConditionalExpression
src/services/api.ts:178:7
     throw await createApiError(response);
   }
 
-  if (response.status === 204) {
+  if (false) {
     return undefined as T;
   }
killedBy: api retorna undefined para resposta 204
statusReason: expected '' to be undefined

[Killed] ConditionalExpression
src/services/api.ts:178:7
     throw await createApiError(response);
   }
 
-  if (response.status === 204) {
+  if (true) {
     return undefined as T;
   }
killedBy: api realiza requisição GET com resposta JSON
statusReason: expected undefined to deeply equal { ok: true }

[Killed] LogicalOperator
src/services/api.ts:182:23
     return undefined as T;
   }
 
-  const contentType = response.headers.get("Content-Type") ?? "";
+  const contentType = response.headers.get("Content-Type") && "";
 
   if (!contentType.includes("application/json")) {
killedBy: api realiza requisição GET com resposta JSON
statusReason: expected '{"ok":true}' to deeply equal { ok: true }

[Killed] ConditionalExpression
src/services/api.ts:184:7
 
   const contentType = response.headers.get("Content-Type") ?? "";
 
-  if (!contentType.includes("application/json")) {
+  if (true) {
     return (await response.text()) as T;
   }
killedBy: api realiza requisição GET com resposta JSON
statusReason: expected '{"ok":true}' to deeply equal { ok: true }

[Killed] BooleanLiteral
src/services/api.ts:184:7
 
   const contentType = response.headers.get("Content-Type") ?? "";
 
-  if (!contentType.includes("application/json")) {
+  if (contentType.includes("application/json")) {
     return (await response.text()) as T;
   }
killedBy: api realiza requisição GET com resposta JSON
statusReason: expected '{"ok":true}' to deeply equal { ok: true }

[NoCoverage] BooleanLiteral
src/services/api.ts:194:7
 async function refreshAccessToken(): Promise<LoginResponse | null> {
   const refreshToken = getRefreshToken();
 
-  if (!refreshToken) {
+  if (refreshToken) {
     clearAuthData();
     return null;

[NoCoverage] BlockStatement
src/services/api.ts:194:22
 async function refreshAccessToken(): Promise<LoginResponse | null> {
   const refreshToken = getRefreshToken();
 
-  if (!refreshToken) {
-    clearAuthData();
-    return null;
-  }
+  if (!refreshToken) {}
 
   if (!refreshPromise) {

[NoCoverage] ConditionalExpression
src/services/api.ts:199:7
     return null;
   }
 
-  if (!refreshPromise) {
+  if (true) {
     refreshPromise = fetch(buildApiUrl("/auth/refresh"), {
       method: "POST",

[NoCoverage] BooleanLiteral
src/services/api.ts:199:7
     return null;
   }
 
-  if (!refreshPromise) {
+  if (refreshPromise) {
     refreshPromise = fetch(buildApiUrl("/auth/refresh"), {
       method: "POST",

[NoCoverage] ObjectLiteral
src/services/api.ts:200:58
   }
 
   if (!refreshPromise) {
-    refreshPromise = fetch(buildApiUrl("/auth/refresh"), {
-      method: "POST",
-      headers: {
-        "Content-Type": "application/json",
-        Accept: "application/json",
-      },
-      body: JSON.stringify({ refreshToken }),
-    })
+    refreshPromise = fetch(buildApiUrl("/auth/refresh"), {})
       .then(async (response) => {
         if (!response.ok) {

[NoCoverage] ObjectLiteral
src/services/api.ts:202:16
   if (!refreshPromise) {
     refreshPromise = fetch(buildApiUrl("/auth/refresh"), {
       method: "POST",
-      headers: {
-        "Content-Type": "application/json",
-        Accept: "application/json",
-      },
+      headers: {},
       body: JSON.stringify({ refreshToken }),
     })

[NoCoverage] BlockStatement
src/services/api.ts:208:33
       },
       body: JSON.stringify({ refreshToken }),
     })
-      .then(async (response) => {
-        if (!response.ok) {
-          clearAuthData();
-          return null;
-        }
-
-        const data = (await response.json()) as LoginResponse;
-        saveAuthData(data);
-
-        return data;
-      })
+      .then(async (response) => {})
       .catch(() => {
         clearAuthData();

[NoCoverage] BlockStatement
src/services/api.ts:209:27
       body: JSON.stringify({ refreshToken }),
     })
       .then(async (response) => {
-        if (!response.ok) {
-          clearAuthData();
-          return null;
-        }
+        if (!response.ok) {}
 
         const data = (await response.json()) as LoginResponse;

[NoCoverage] BooleanLiteral
src/services/api.ts:209:13
       body: JSON.stringify({ refreshToken }),
     })
       .then(async (response) => {
-        if (!response.ok) {
+        if (response.ok) {
           clearAuthData();
           return null;

[NoCoverage] BlockStatement
src/services/api.ts:219:20
 
         return data;
       })
-      .catch(() => {
-        clearAuthData();
-        return null;
-      })
+      .catch(() => {})
       .finally(() => {
         refreshPromise = null;

[NoCoverage] BlockStatement
src/services/api.ts:223:22
         clearAuthData();
         return null;
       })
-      .finally(() => {
-        refreshPromise = null;
-      });
+      .finally(() => {});
   }
 

[Killed] BlockStatement
src/services/api.ts:231:68
   return refreshPromise;
 }
 
-function normalizeBody(body: unknown): BodyInit | null | undefined {
-  if (body === undefined || body === null) {
-    return undefined;
-  }
-
-  if (typeof FormData !== "undefined" && body instanceof FormData) {
-    return body;
-  }
-
-  if (
-    typeof body === "string" ||
-    body instanceof Blob ||
-    body instanceof ArrayBuffer ||
-    body instanceof URLSearchParams
-  ) {
-    return body as BodyInit;
-  }
-
-  return JSON.stringify(body);
-}
+function normalizeBody(body: unknown): BodyInit | null | undefined {}
 
 async function createApiError(response: Response): Promise<ApiRequestError> {
killedBy: api envia body JSON quando body é objeto
statusReason: expected { method: 'POST', …(2) } to deeply equal ObjectContaining{…}

[Killed] EqualityOperator
src/services/api.ts:232:7
 }
 
 function normalizeBody(body: unknown): BodyInit | null | undefined {
-  if (body === undefined || body === null) {
+  if (body !== undefined || body === null) {
     return undefined;
   }
killedBy: api envia body JSON quando body é objeto
statusReason: expected { method: 'POST', …(2) } to deeply equal ObjectContaining{…}

[Killed] ConditionalExpression
src/services/api.ts:232:7
 }
 
 function normalizeBody(body: unknown): BodyInit | null | undefined {
-  if (body === undefined || body === null) {
+  if (true) {
     return undefined;
   }
killedBy: api envia body JSON quando body é objeto
statusReason: expected { method: 'POST', …(2) } to deeply equal ObjectContaining{…}

[Killed] LogicalOperator
src/services/api.ts:236:7
     return undefined;
   }
 
-  if (typeof FormData !== "undefined" && body instanceof FormData) {
+  if (typeof FormData !== "undefined" || body instanceof FormData) {
     return body;
   }
killedBy: api envia body JSON quando body é objeto
statusReason: expected { method: 'POST', …(2) } to deeply equal ObjectContaining{…}
