[Killed] ConditionalExpression
src/services/api.ts:236:7
     return undefined;
   }
 
-  if (typeof FormData !== "undefined" && body instanceof FormData) {
+  if (true) {
     return body;
   }
killedBy: api envia body JSON quando body é objeto
statusReason: expected { method: 'POST', …(2) } to deeply equal ObjectContaining{…}

[Killed] EqualityOperator
src/services/api.ts:241:5
   }
 
   if (
-    typeof body === "string" ||
+    typeof body !== "string" ||
     body instanceof Blob ||
     body instanceof ArrayBuffer ||
killedBy: api envia body JSON quando body é objeto
statusReason: expected { method: 'POST', …(2) } to deeply equal ObjectContaining{…}

[Killed] ConditionalExpression
src/services/api.ts:241:5
   }
 
   if (
-    typeof body === "string" ||
-    body instanceof Blob ||
-    body instanceof ArrayBuffer ||
-    body instanceof URLSearchParams
+    true
   ) {
     return body as BodyInit;
killedBy: api envia body JSON quando body é objeto
statusReason: expected { method: 'POST', …(2) } to deeply equal ObjectContaining{…}

[NoCoverage] BlockStatement
src/services/api.ts:245:5
     body instanceof Blob ||
     body instanceof ArrayBuffer ||
     body instanceof URLSearchParams
-  ) {
-    return body as BodyInit;
-  }
+  ) {}
 
   return JSON.stringify(body);

[Killed] BlockStatement
src/services/api.ts:252:77
   return JSON.stringify(body);
 }
 
-async function createApiError(response: Response): Promise<ApiRequestError> {
-  const fallback: ApiError = {
-    timestamp: new Date().toISOString(),
-    status: response.status,
-    title: "Erro na requisição",
-    detail: "Erro ao comunicar com a API",
-    instance: undefined,
-  };
-
-  try {
-    const data = await response.json();
-
-    const apiError: ApiError = {
-      timestamp: data.timestamp ?? fallback.timestamp,
-      status: data.status ?? response.status,
-      title: data.title ?? fallback.title,
-      detail: data.detail ?? fallback.detail,
-      instance: data.instance,
-    };
-
-    return new ApiRequestError(apiError, data);
-  } catch {
-    return new ApiRequestError(fallback);
-  }
-}
+async function createApiError(response: Response): Promise<ApiRequestError> {}
killedBy: api lança ApiRequestError para resposta de erro
statusReason: expected undefined to be an instance of ApiRequestError

[Killed] BlockStatement
src/services/api.ts:261:7
     instance: undefined,
   };
 
-  try {
-    const data = await response.json();
-
-    const apiError: ApiError = {
-      timestamp: data.timestamp ?? fallback.timestamp,
-      status: data.status ?? response.status,
-      title: data.title ?? fallback.title,
-      detail: data.detail ?? fallback.detail,
-      instance: data.instance,
-    };
-
-    return new ApiRequestError(apiError, data);
-  } catch {
+  try {} catch {
     return new ApiRequestError(fallback);
   }
killedBy: api lança ApiRequestError para resposta de erro
statusReason: expected undefined to be an instance of ApiRequestError

[Survived] LogicalOperator
src/services/api.ts:265:18
     const data = await response.json();
 
     const apiError: ApiError = {
-      timestamp: data.timestamp ?? fallback.timestamp,
+      timestamp: data.timestamp && fallback.timestamp,
       status: data.status ?? response.status,
       title: data.title ?? fallback.title,

[Survived] LogicalOperator
src/services/api.ts:266:15
 
     const apiError: ApiError = {
       timestamp: data.timestamp ?? fallback.timestamp,
-      status: data.status ?? response.status,
+      status: data.status && response.status,
       title: data.title ?? fallback.title,
       detail: data.detail ?? fallback.detail,

[Survived] LogicalOperator
src/services/api.ts:267:14
     const apiError: ApiError = {
       timestamp: data.timestamp ?? fallback.timestamp,
       status: data.status ?? response.status,
-      title: data.title ?? fallback.title,
+      title: data.title && fallback.title,
       detail: data.detail ?? fallback.detail,
       instance: data.instance,

[Survived] LogicalOperator
src/services/api.ts:268:15
       timestamp: data.timestamp ?? fallback.timestamp,
       status: data.status ?? response.status,
       title: data.title ?? fallback.title,
-      detail: data.detail ?? fallback.detail,
+      detail: data.detail && fallback.detail,
       instance: data.instance,
     };

[NoCoverage] BlockStatement
src/services/api.ts:273:11
     };
 
     return new ApiRequestError(apiError, data);
-  } catch {
-    return new ApiRequestError(fallback);
-  }
+  } catch {}
 }
