[Killed] BlockStatement
src/utils/errorMessage.ts:3:57
 import { ApiRequestError } from "@/services/api";
 
-export function getErrorMessage(error: unknown): string {
-  if (error instanceof ApiRequestError) {
-    return sanitizeMessage(error.detail || error.title);
-  }
-
-  if (error instanceof Error) {
-    return sanitizeMessage(error.message);
-  }
-
-  return "Ocorreu um erro inesperado. Tente novamente.";
-}
+export function getErrorMessage(error: unknown): string {}
 
 export function getErrorTitle(error: unknown): string {
killedBy: FeedbackModalContext exibe feedback de erro usando Error
statusReason: Unable to find an element with the text: Falha controlada. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button
        type="button"

[Killed] ConditionalExpression
src/utils/errorMessage.ts:4:7
 import { ApiRequestError } from "@/services/api";
 
 export function getErrorMessage(error: unknown): string {
-  if (error instanceof ApiRequestError) {
+  if (true) {
     return sanitizeMessage(error.detail || error.title);
   }
killedBy: FeedbackModalContext exibe feedback de erro usando Error
statusReason: Unable to find an element with the text: Falha controlada. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button
        type="button"

[Survived] BlockStatement
src/utils/errorMessage.ts:4:41
 import { ApiRequestError } from "@/services/api";
 
 export function getErrorMessage(error: unknown): string {
-  if (error instanceof ApiRequestError) {
-    return sanitizeMessage(error.detail || error.title);
-  }
+  if (error instanceof ApiRequestError) {}
 
   if (error instanceof Error) {

[Killed] LogicalOperator
src/utils/errorMessage.ts:5:28
 
 export function getErrorMessage(error: unknown): string {
   if (error instanceof ApiRequestError) {
-    return sanitizeMessage(error.detail || error.title);
+    return sanitizeMessage(error.detail && error.title);
   }
 
killedBy: errorMessage extrai título de ApiRequestError
statusReason: expected 'Cadastro inválido' to be 'E-mail inválido' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorMessage.ts:5:28
 
 export function getErrorMessage(error: unknown): string {
   if (error instanceof ApiRequestError) {
-    return sanitizeMessage(error.detail || error.title);
+    return sanitizeMessage(true);
   }
 
killedBy: errorMessage extrai título de ApiRequestError
statusReason: message.trim is not a function

[Killed] BlockStatement
src/utils/errorMessage.ts:8:31
     return sanitizeMessage(error.detail || error.title);
   }
 
-  if (error instanceof Error) {
-    return sanitizeMessage(error.message);
-  }
+  if (error instanceof Error) {}
 
   return "Ocorreu um erro inesperado. Tente novamente.";
killedBy: FeedbackModalContext exibe feedback de erro usando Error
statusReason: Unable to find an element with the text: Falha controlada. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button
        type="button"

[Killed] ConditionalExpression
src/utils/errorMessage.ts:8:7
     return sanitizeMessage(error.detail || error.title);
   }
 
-  if (error instanceof Error) {
+  if (true) {
     return sanitizeMessage(error.message);
   }
killedBy: errorMessage retorna fallback para erro desconhecido
statusReason: Cannot read properties of null (reading 'message')

[Killed] StringLiteral
src/utils/errorMessage.ts:12:10
     return sanitizeMessage(error.message);
   }
 
-  return "Ocorreu um erro inesperado. Tente novamente.";
+  return "";
 }
 
killedBy: errorMessage retorna fallback para erro desconhecido
statusReason: expected '' to be 'Ocorreu um erro inesperado. Tente nov…' // Object.is equality

[Killed] BlockStatement
src/utils/errorMessage.ts:15:55
   return "Ocorreu um erro inesperado. Tente novamente.";
 }
 
-export function getErrorTitle(error: unknown): string {
-  if (error instanceof ApiRequestError) {
-    return error.title || "Erro";
-  }
-
-  return "Erro";
-}
+export function getErrorTitle(error: unknown): string {}
 
 export function isUnauthorizedError(error: unknown): boolean {
killedBy: errorMessage extrai título de ApiRequestError
statusReason: expected undefined to be 'Cadastro inválido' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorMessage.ts:16:7
 }
 
 export function getErrorTitle(error: unknown): string {
-  if (error instanceof ApiRequestError) {
+  if (false) {
     return error.title || "Erro";
   }
killedBy: errorMessage extrai título de ApiRequestError
statusReason: expected 'Erro' to be 'Cadastro inválido' // Object.is equality

[Killed] BlockStatement
src/utils/errorMessage.ts:16:41
 }
 
 export function getErrorTitle(error: unknown): string {
-  if (error instanceof ApiRequestError) {
-    return error.title || "Erro";
-  }
+  if (error instanceof ApiRequestError) {}
 
   return "Erro";
killedBy: errorMessage extrai título de ApiRequestError
statusReason: expected 'Erro' to be 'Cadastro inválido' // Object.is equality

[Killed] LogicalOperator
src/utils/errorMessage.ts:17:12
 
 export function getErrorTitle(error: unknown): string {
   if (error instanceof ApiRequestError) {
-    return error.title || "Erro";
+    return error.title && "Erro";
   }
 
killedBy: errorMessage extrai título de ApiRequestError
statusReason: expected 'Erro' to be 'Cadastro inválido' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorMessage.ts:17:12
 
 export function getErrorTitle(error: unknown): string {
   if (error instanceof ApiRequestError) {
-    return error.title || "Erro";
+    return true;
   }
 
killedBy: errorMessage extrai título de ApiRequestError
statusReason: expected true to be 'Cadastro inválido' // Object.is equality

[Killed] StringLiteral
src/utils/errorMessage.ts:20:10
     return error.title || "Erro";
   }
 
-  return "Erro";
+  return "";
 }
 
killedBy: FeedbackModalContext exibe feedback de erro usando Error
statusReason: Unable to find an element with the text: Erro. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button
        type="button"

[Killed] BlockStatement
src/utils/errorMessage.ts:23:62
   return "Erro";
 }
 
-export function isUnauthorizedError(error: unknown): boolean {
-  return error instanceof ApiRequestError && error.status === 401;
-}
+export function isUnauthorizedError(error: unknown): boolean {}
 
 export function isForbiddenError(error: unknown): boolean {
killedBy: errorMessage identifica 401 e 403
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/errorMessage.ts:24:10
 }
 
 export function isUnauthorizedError(error: unknown): boolean {
-  return error instanceof ApiRequestError && error.status === 401;
+  return false;
 }
 
killedBy: errorMessage identifica 401 e 403
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/errorMessage.ts:24:46
 }
 
 export function isUnauthorizedError(error: unknown): boolean {
-  return error instanceof ApiRequestError && error.status === 401;
+  return error instanceof ApiRequestError && error.status !== 401;
 }
 
killedBy: errorMessage identifica 401 e 403
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/errorMessage.ts:27:59
   return error instanceof ApiRequestError && error.status === 401;
 }
 
-export function isForbiddenError(error: unknown): boolean {
-  return error instanceof ApiRequestError && error.status === 403;
-}
+export function isForbiddenError(error: unknown): boolean {}
 
 export function shouldShowErrorAsModal(error: unknown): boolean {
killedBy: errorMessage identifica 401 e 403
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/errorMessage.ts:28:10
 }
 
 export function isForbiddenError(error: unknown): boolean {
-  return error instanceof ApiRequestError && error.status === 403;
+  return false;
 }
 
killedBy: errorMessage identifica 401 e 403
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/errorMessage.ts:28:46
 }
 
 export function isForbiddenError(error: unknown): boolean {
-  return error instanceof ApiRequestError && error.status === 403;
+  return error instanceof ApiRequestError && error.status !== 403;
 }
 
killedBy: errorMessage identifica 401 e 403
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/errorMessage.ts:31:65
   return error instanceof ApiRequestError && error.status === 403;
 }
 
-export function shouldShowErrorAsModal(error: unknown): boolean {
-  if (!(error instanceof ApiRequestError)) {
-    return true;
-  }
-
-  return error.status >= 500 || error.status === 403 || error.status === 401;
-}
+export function shouldShowErrorAsModal(error: unknown): boolean {}
 
 function sanitizeMessage(message: string | null | undefined): string {
killedBy: errorMessage define quando erro deve aparecer como modal
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/utils/errorMessage.ts:32:7
 }
 
 export function shouldShowErrorAsModal(error: unknown): boolean {
-  if (!(error instanceof ApiRequestError)) {
+  if (error instanceof ApiRequestError) {
     return true;
   }
killedBy: errorMessage define quando erro deve aparecer como modal
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/errorMessage.ts:32:7
 }
 
 export function shouldShowErrorAsModal(error: unknown): boolean {
-  if (!(error instanceof ApiRequestError)) {
+  if (true) {
     return true;
   }
killedBy: errorMessage define quando erro deve aparecer como modal
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/errorMessage.ts:33:12
 
 export function shouldShowErrorAsModal(error: unknown): boolean {
   if (!(error instanceof ApiRequestError)) {
-    return true;
+    return false;
   }
 
killedBy: errorMessage define quando erro deve aparecer como modal
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/errorMessage.ts:36:33
     return true;
   }
 
-  return error.status >= 500 || error.status === 403 || error.status === 401;
+  return error.status >= 500 || error.status !== 403 || error.status === 401;
 }
 
killedBy: errorMessage define quando erro deve aparecer como modal
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/utils/errorMessage.ts:36:10
     return true;
   }
 
-  return error.status >= 500 || error.status === 403 || error.status === 401;
+  return error.status >= 500 && error.status === 403 || error.status === 401;
 }
 
killedBy: errorMessage define quando erro deve aparecer como modal
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/errorMessage.ts:39:70
   return error.status >= 500 || error.status === 403 || error.status === 401;
 }
 
-function sanitizeMessage(message: string | null | undefined): string {
-  if (!message || !message.trim()) {
-    return "Ocorreu um erro inesperado. Tente novamente.";
-  }
-
-  const lowerMessage = message.toLowerCase();
-
-  const looksTechnical =
-    lowerMessage.includes("jdbc") ||
-    lowerMessage.includes("sql") ||
-    lowerMessage.includes("hibernate") ||
-    lowerMessage.includes("stack trace") ||
-    lowerMessage.includes("nullpointerexception") ||
-    lowerMessage.includes("org.springframework") ||
-    lowerMessage.includes("java.") ||
-    lowerMessage.includes("function ") ||
-    lowerMessage.includes("does not exist");
-
-  if (looksTechnical) {
-    return "Ocorreu um erro interno. Tente novamente em instantes.";
-  }
-
-  return message.trim();
-}
+function sanitizeMessage(message: string | null | undefined): string {}
killedBy: FeedbackModal fecha modal
statusReason: Unable to find an element with the text: Erro tratado. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button
        type="button"

[Killed] ConditionalExpression
src/utils/errorMessage.ts:40:7
 }
 
 function sanitizeMessage(message: string | null | undefined): string {
-  if (!message || !message.trim()) {
+  if (true) {
     return "Ocorreu um erro inesperado. Tente novamente.";
   }
killedBy: FeedbackModalContext exibe feedback de erro usando Error
statusReason: Unable to find an element with the text: Falha controlada. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button
        type="button"

[Killed] BooleanLiteral
src/utils/errorMessage.ts:40:19
 }
 
 function sanitizeMessage(message: string | null | undefined): string {
-  if (!message || !message.trim()) {
+  if (!message || message.trim()) {
     return "Ocorreu um erro inesperado. Tente novamente.";
   }
killedBy: FeedbackModal fecha modal
statusReason: Unable to find an element with the text: Erro tratado. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button
        type="button"

[Killed] MethodExpression
src/utils/errorMessage.ts:44:24
     return "Ocorreu um erro inesperado. Tente novamente.";
   }
 
-  const lowerMessage = message.toLowerCase();
+  const lowerMessage = message.toUpperCase();
 
   const looksTechnical =
killedBy: errorMessage substitui mensagens técnicas por mensagem segura
statusReason: expected 'JDBC connection failed' to be 'Ocorreu um erro interno. Tente novame…' // Object.is equality

[Killed] LogicalOperator
src/utils/errorMessage.ts:47:5
   const lowerMessage = message.toLowerCase();
 
   const looksTechnical =
-    lowerMessage.includes("jdbc") ||
-    lowerMessage.includes("sql") ||
+    lowerMessage.includes("jdbc") && lowerMessage.includes("sql") ||
     lowerMessage.includes("hibernate") ||
     lowerMessage.includes("stack trace") ||
killedBy: errorMessage substitui mensagens técnicas por mensagem segura
statusReason: expected 'JDBC connection failed' to be 'Ocorreu um erro interno. Tente novame…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorMessage.ts:47:5
   const lowerMessage = message.toLowerCase();
 
   const looksTechnical =
-    lowerMessage.includes("jdbc") ||
-    lowerMessage.includes("sql") ||
-    lowerMessage.includes("hibernate") ||
-    lowerMessage.includes("stack trace") ||
-    lowerMessage.includes("nullpointerexception") ||
-    lowerMessage.includes("org.springframework") ||
-    lowerMessage.includes("java.") ||
-    lowerMessage.includes("function ") ||
-    lowerMessage.includes("does not exist");
+    false;
 
   if (looksTechnical) {
killedBy: errorMessage substitui mensagens técnicas por mensagem segura
statusReason: expected 'JDBC connection failed' to be 'Ocorreu um erro interno. Tente novame…' // Object.is equality

[Killed] StringLiteral
src/utils/errorMessage.ts:48:27
 
   const looksTechnical =
     lowerMessage.includes("jdbc") ||
-    lowerMessage.includes("sql") ||
+    lowerMessage.includes("") ||
     lowerMessage.includes("hibernate") ||
     lowerMessage.includes("stack trace") ||
killedBy: errorMessage retorna mensagem amigável para erro comum
statusReason: expected 'Ocorreu um erro interno. Tente novame…' to be 'Erro de validação' // Object.is equality

[Killed] StringLiteral
src/utils/errorMessage.ts:53:27
     lowerMessage.includes("stack trace") ||
     lowerMessage.includes("nullpointerexception") ||
     lowerMessage.includes("org.springframework") ||
-    lowerMessage.includes("java.") ||
+    lowerMessage.includes("") ||
     lowerMessage.includes("function ") ||
     lowerMessage.includes("does not exist");
killedBy: errorMessage retorna mensagem amigável para erro comum
statusReason: expected 'Ocorreu um erro interno. Tente novame…' to be 'Erro de validação' // Object.is equality

[Killed] StringLiteral
src/utils/errorMessage.ts:54:27
     lowerMessage.includes("nullpointerexception") ||
     lowerMessage.includes("org.springframework") ||
     lowerMessage.includes("java.") ||
-    lowerMessage.includes("function ") ||
+    lowerMessage.includes("") ||
     lowerMessage.includes("does not exist");
 
killedBy: errorMessage retorna mensagem amigável para erro comum
statusReason: expected 'Ocorreu um erro interno. Tente novame…' to be 'Erro de validação' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorMessage.ts:57:7
     lowerMessage.includes("function ") ||
     lowerMessage.includes("does not exist");
 
-  if (looksTechnical) {
+  if (false) {
     return "Ocorreu um erro interno. Tente novamente em instantes.";
   }
killedBy: errorMessage substitui mensagens técnicas por mensagem segura
statusReason: expected 'JDBC connection failed' to be 'Ocorreu um erro interno. Tente novame…' // Object.is equality

[Killed] BlockStatement
src/utils/errorMessage.ts:57:23
     lowerMessage.includes("function ") ||
     lowerMessage.includes("does not exist");
 
-  if (looksTechnical) {
-    return "Ocorreu um erro interno. Tente novamente em instantes.";
-  }
+  if (looksTechnical) {}
 
   return message.trim();
killedBy: errorMessage substitui mensagens técnicas por mensagem segura
statusReason: expected 'JDBC connection failed' to be 'Ocorreu um erro interno. Tente novame…' // Object.is equality

[Survived] MethodExpression
src/utils/errorMessage.ts:61:10
     return "Ocorreu um erro interno. Tente novamente em instantes.";
   }
 
-  return message.trim();
+  return message;
 }
