[Killed] BlockStatement
src/services/authService.ts:15:62
 } from "./api";
 
 export const authService = {
-  async login(request: LoginRequest): Promise<LoginResponse> {
-    const response = await apiFetch<LoginResponse>("/auth/login", {
-      method: "POST",
-      body: request,
-      auth: false,
-    });
-
-    saveAuthData(response);
-
-    return response;
-  },
+  async login(request: LoginRequest): Promise<LoginResponse> {},
 
   async refresh(): Promise<LoginResponse> {
killedBy: authService realiza login e salva dados de autenticação
statusReason: expected undefined to deeply equal { token: 'token', …(4) }

[Killed] BooleanLiteral
src/services/authService.ts:19:13
     const response = await apiFetch<LoginResponse>("/auth/login", {
       method: "POST",
       body: request,
-      auth: false,
+      auth: true,
     });
 
killedBy: authService realiza login e salva dados de autenticação
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/login', …(1) ]

Received:

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] BlockStatement
src/services/authService.ts:27:43
     return response;
   },
 
-  async refresh(): Promise<LoginResponse> {
-    const refreshToken = getRefreshToken();
-
-    if (!refreshToken) {
-      throw new Error("Refresh token não encontrado");
-    }
-
-    const response = await apiFetch<LoginResponse>("/auth/refresh", {
-      method: "POST",
-      body: { refreshToken },
-      auth: false,
-      retry: false,
-    });
-
-    saveAuthData(response);
-
-    return response;
-  },
+  async refresh(): Promise<LoginResponse> {},
 
   async logout(): Promise<void> {
killedBy: authService renova token usando refresh token salvo
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/refresh', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/services/authService.ts:30:24
   async refresh(): Promise<LoginResponse> {
     const refreshToken = getRefreshToken();
 
-    if (!refreshToken) {
-      throw new Error("Refresh token não encontrado");
-    }
+    if (!refreshToken) {}
 
     const response = await apiFetch<LoginResponse>("/auth/refresh", {
killedBy: authService lança erro ao renovar sem refresh token
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/services/authService.ts:31:23
     const refreshToken = getRefreshToken();
 
     if (!refreshToken) {
-      throw new Error("Refresh token não encontrado");
+      throw new Error("");
     }
 
killedBy: authService lança erro ao renovar sem refresh token
statusReason: expected [Function] to throw error including 'Refresh token não encontrado' but got ''

[Killed] StringLiteral
src/services/authService.ts:34:52
       throw new Error("Refresh token não encontrado");
     }
 
-    const response = await apiFetch<LoginResponse>("/auth/refresh", {
+    const response = await apiFetch<LoginResponse>("", {
       method: "POST",
       body: { refreshToken },
killedBy: authService renova token usando refresh token salvo
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/refresh', …(1) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] ObjectLiteral
src/services/authService.ts:34:69
       throw new Error("Refresh token não encontrado");
     }
 
-    const response = await apiFetch<LoginResponse>("/auth/refresh", {
-      method: "POST",
-      body: { refreshToken },
-      auth: false,
-      retry: false,
-    });
+    const response = await apiFetch<LoginResponse>("/auth/refresh", {});
 
     saveAuthData(response);
killedBy: authService renova token usando refresh token salvo
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/refresh', …(1) ]

Received:

  1st vi.fn() call:

  [
    "/auth/refresh",

[Killed] StringLiteral
src/services/authService.ts:35:15
     }
 
     const response = await apiFetch<LoginResponse>("/auth/refresh", {
-      method: "POST",
+      method: "",
       body: { refreshToken },
       auth: false,
killedBy: authService renova token usando refresh token salvo
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/refresh', …(1) ]

Received:

  1st vi.fn() call:

@@ -3,9 +3,9 @@
    {

[Killed] BooleanLiteral
src/services/authService.ts:37:13
     const response = await apiFetch<LoginResponse>("/auth/refresh", {
       method: "POST",
       body: { refreshToken },
-      auth: false,
+      auth: true,
       retry: false,
     });
killedBy: authService renova token usando refresh token salvo
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/refresh', …(1) ]

Received:

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] BooleanLiteral
src/services/authService.ts:38:14
       method: "POST",
       body: { refreshToken },
       auth: false,
-      retry: false,
+      retry: true,
     });
 
killedBy: authService renova token usando refresh token salvo
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/refresh', …(1) ]

Received:

  1st vi.fn() call:

@@ -4,8 +4,8 @@
      "auth": false,

[Killed] BlockStatement
src/services/authService.ts:46:33
     return response;
   },
 
-  async logout(): Promise<void> {
-    const refreshToken = getRefreshToken();
-
-    try {
-      if (refreshToken) {
-        await apiFetch<void>("/auth/logout", {
-          method: "POST",
-          body: { refreshToken },
-          auth: false,
-          retry: false,
-        });
-      }
-    } finally {
-      clearAuthData();
-    }
-  },
+  async logout(): Promise<void> {},
 
   async me(): Promise<AuthenticatedUserResponse> {
killedBy: authService faz logout na API quando há refresh token e limpa sessão
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/logout', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/services/authService.ts:49:9
   async logout(): Promise<void> {
     const refreshToken = getRefreshToken();
 
-    try {
-      if (refreshToken) {
-        await apiFetch<void>("/auth/logout", {
-          method: "POST",
-          body: { refreshToken },
-          auth: false,
-          retry: false,
-        });
-      }
-    } finally {
+    try {} finally {
       clearAuthData();
     }
killedBy: authService faz logout na API quando há refresh token e limpa sessão
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/logout', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/services/authService.ts:50:11
     const refreshToken = getRefreshToken();
 
     try {
-      if (refreshToken) {
+      if (false) {
         await apiFetch<void>("/auth/logout", {
           method: "POST",
killedBy: authService faz logout na API quando há refresh token e limpa sessão
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/logout', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/services/authService.ts:50:25
     const refreshToken = getRefreshToken();
 
     try {
-      if (refreshToken) {
-        await apiFetch<void>("/auth/logout", {
-          method: "POST",
-          body: { refreshToken },
-          auth: false,
-          retry: false,
-        });
-      }
+      if (refreshToken) {}
     } finally {
       clearAuthData();
killedBy: authService faz logout na API quando há refresh token e limpa sessão
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/logout', …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/services/authService.ts:52:19
     try {
       if (refreshToken) {
         await apiFetch<void>("/auth/logout", {
-          method: "POST",
+          method: "",
           body: { refreshToken },
           auth: false,
killedBy: authService faz logout na API quando há refresh token e limpa sessão
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/logout', …(1) ]

Received:

  1st vi.fn() call:

@@ -3,9 +3,9 @@
    {

[Killed] BlockStatement
src/services/authService.ts:58:15
           retry: false,
         });
       }
-    } finally {
-      clearAuthData();
-    }
+    } finally {}
   },
 
killedBy: authService faz logout na API quando há refresh token e limpa sessão
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/services/authService.ts:63:50
     }
   },
 
-  async me(): Promise<AuthenticatedUserResponse> {
-    return apiFetch<AuthenticatedUserResponse>("/auth/me", {
-      method: "GET",
-    });
-  },
+  async me(): Promise<AuthenticatedUserResponse> {},
 
   getStoredUser(): AuthenticatedUserResponse | null {
killedBy: authService busca usuário autenticado
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/me', { method: 'GET' } ]

Number of calls: 0

[Killed] StringLiteral
src/services/authService.ts:64:48
   },
 
   async me(): Promise<AuthenticatedUserResponse> {
-    return apiFetch<AuthenticatedUserResponse>("/auth/me", {
+    return apiFetch<AuthenticatedUserResponse>("", {
       method: "GET",
     });
killedBy: authService busca usuário autenticado
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/me', { method: 'GET' } ]

Received:

  1st vi.fn() call:

  [
-   "/auth/me",

[Killed] StringLiteral
src/services/authService.ts:65:15
 
   async me(): Promise<AuthenticatedUserResponse> {
     return apiFetch<AuthenticatedUserResponse>("/auth/me", {
-      method: "GET",
+      method: "",
     });
   },
killedBy: authService busca usuário autenticado
statusReason: expected "vi.fn()" to be called with arguments: [ '/auth/me', { method: 'GET' } ]

Received:

  1st vi.fn() call:

  [
    "/auth/me",

[Killed] BlockStatement
src/services/authService.ts:69:53
     });
   },
 
-  getStoredUser(): AuthenticatedUserResponse | null {
-    return getStoredUser();
-  },
+  getStoredUser(): AuthenticatedUserResponse | null {},
 
   clearSession(): void {
killedBy: authService expõe usuário salvo e limpeza de sessão
statusReason: expected undefined to deeply equal { id: 1, …(3) }

[Killed] BlockStatement
src/services/authService.ts:73:24
     return getStoredUser();
   },
 
-  clearSession(): void {
-    clearAuthData();
-  },
+  clearSession(): void {},
 };
killedBy: authService expõe usuário salvo e limpeza de sessão
statusReason: expected "vi.fn()" to be called at least once
