[Killed] BlockStatement
src/utils/formatters.ts:1:74
-export function formatCurrency(value: number | null | undefined): string {
-  const safeValue = typeof value === "number" && !Number.isNaN(value) ? value : 0;
-
-  return new Intl.NumberFormat("pt-BR", {
-    style: "currency",
-    currency: "BRL",
-  }).format(safeValue);
-}
+export function formatCurrency(value: number | null | undefined): string {}
 
 export function formatDateTime(value: string | null | undefined): string {
killedBy: formatters formata moeda em BRL
statusReason: expected undefined to be 'R$ 1.234,50' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:2:21
 export function formatCurrency(value: number | null | undefined): string {
-  const safeValue = typeof value === "number" && !Number.isNaN(value) ? value : 0;
+  const safeValue = false ? value : 0;
 
   return new Intl.NumberFormat("pt-BR", {
killedBy: formatters formata moeda em BRL
statusReason: expected 'R$ 0,00' to be 'R$ 1.234,50' // Object.is equality

[Killed] LogicalOperator
src/utils/formatters.ts:2:21
 export function formatCurrency(value: number | null | undefined): string {
-  const safeValue = typeof value === "number" && !Number.isNaN(value) ? value : 0;
+  const safeValue = typeof value === "number" || !Number.isNaN(value) ? value : 0;
 
   return new Intl.NumberFormat("pt-BR", {
killedBy: formatters usa zero para moeda inválida
statusReason: expected 'R$ NaN' to be 'R$ 0,00' // Object.is equality

[Killed] StringLiteral
src/utils/formatters.ts:4:32
 export function formatCurrency(value: number | null | undefined): string {
   const safeValue = typeof value === "number" && !Number.isNaN(value) ? value : 0;
 
-  return new Intl.NumberFormat("pt-BR", {
+  return new Intl.NumberFormat("", {
     style: "currency",
     currency: "BRL",
killedBy: formatters formata moeda em BRL
statusReason: Incorrect locale information provided

[Killed] StringLiteral
src/utils/formatters.ts:5:12
   const safeValue = typeof value === "number" && !Number.isNaN(value) ? value : 0;
 
   return new Intl.NumberFormat("pt-BR", {
-    style: "currency",
+    style: "",
     currency: "BRL",
   }).format(safeValue);
killedBy: formatters formata moeda em BRL
statusReason: Value  out of range for Intl.NumberFormat options property style

[Killed] BlockStatement
src/utils/formatters.ts:10:74
   }).format(safeValue);
 }
 
-export function formatDateTime(value: string | null | undefined): string {
-  if (!value) return "-";
-
-  const date = new Date(value);
-
-  if (Number.isNaN(date.getTime())) {
-    return "-";
-  }
-
-  return new Intl.DateTimeFormat("pt-BR", {
-    dateStyle: "short",
-    timeStyle: "short",
-  }).format(date);
-}
+export function formatDateTime(value: string | null | undefined): string {}
 
 export function formatDate(value: string | null | undefined): string {
killedBy: formatters retorna hífen para datas ausentes ou inválidas
statusReason: expected undefined to be '-' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:11:7
 }
 
 export function formatDateTime(value: string | null | undefined): string {
-  if (!value) return "-";
+  if (true) return "-";
 
   const date = new Date(value);
killedBy: formatters formata data e data/hora válidas
statusReason: expected '-' not to be '-' // Object.is equality

[Killed] BooleanLiteral
src/utils/formatters.ts:11:7
 }
 
 export function formatDateTime(value: string | null | undefined): string {
-  if (!value) return "-";
+  if (value) return "-";
 
   const date = new Date(value);
killedBy: formatters formata data e data/hora válidas
statusReason: expected '-' not to be '-' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:15:7
 
   const date = new Date(value);
 
-  if (Number.isNaN(date.getTime())) {
+  if (true) {
     return "-";
   }
killedBy: formatters formata data e data/hora válidas
statusReason: expected '-' not to be '-' // Object.is equality

[Killed] BlockStatement
src/utils/formatters.ts:15:37
 
   const date = new Date(value);
 
-  if (Number.isNaN(date.getTime())) {
-    return "-";
-  }
+  if (Number.isNaN(date.getTime())) {}
 
   return new Intl.DateTimeFormat("pt-BR", {
killedBy: formatters retorna hífen para datas ausentes ou inválidas
statusReason: Invalid time value

[Killed] BlockStatement
src/utils/formatters.ts:25:70
   }).format(date);
 }
 
-export function formatDate(value: string | null | undefined): string {
-  if (!value) return "-";
-
-  const date = new Date(value);
-
-  if (Number.isNaN(date.getTime())) {
-    return "-";
-  }
-
-  return new Intl.DateTimeFormat("pt-BR", {
-    dateStyle: "short",
-  }).format(date);
-}
+export function formatDate(value: string | null | undefined): string {}
 
 export function formatCep(value: string | null | undefined): string {
killedBy: formatters retorna hífen para datas ausentes ou inválidas
statusReason: expected undefined to be '-' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:26:7
 }
 
 export function formatDate(value: string | null | undefined): string {
-  if (!value) return "-";
+  if (false) return "-";
 
   const date = new Date(value);
killedBy: formatters retorna hífen para datas ausentes ou inválidas
statusReason: expected '31/12/1969' to be '-' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:26:7
 }
 
 export function formatDate(value: string | null | undefined): string {
-  if (!value) return "-";
+  if (true) return "-";
 
   const date = new Date(value);
killedBy: formatters formata data e data/hora válidas
statusReason: expected '-' not to be '-' // Object.is equality

[Survived] ConditionalExpression
src/utils/formatters.ts:30:7
 
   const date = new Date(value);
 
-  if (Number.isNaN(date.getTime())) {
+  if (false) {
     return "-";
   }

[Killed] BlockStatement
src/utils/formatters.ts:39:69
   }).format(date);
 }
 
-export function formatCep(value: string | null | undefined): string {
-  if (!value) return "";
-
-  const digits = value.replace(/\D/g, "").slice(0, 8);
-
-  if (digits.length <= 5) {
-    return digits;
-  }
-
-  return `${digits.slice(0, 5)}-${digits.slice(5)}`;
-}
+export function formatCep(value: string | null | undefined): string {}
 
 export function formatCpf(value: string | null | undefined): string {
killedBy: CartPage aplica cupom e calcula frete
statusReason: expected "vi.fn()" to be called with arguments: [ '13480000' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/utils/formatters.ts:40:7
 }
 
 export function formatCep(value: string | null | undefined): string {
-  if (!value) return "";
+  if (value) return "";
 
   const digits = value.replace(/\D/g, "").slice(0, 8);
killedBy: formatters formata CEP
statusReason: expected '' to be '13480-000' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:40:7
 }
 
 export function formatCep(value: string | null | undefined): string {
-  if (!value) return "";
+  if (false) return "";
 
   const digits = value.replace(/\D/g, "").slice(0, 8);
killedBy: formatters formata CEP
statusReason: Cannot read properties of null (reading 'replace')

[Survived] MethodExpression
src/utils/formatters.ts:42:18
 export function formatCep(value: string | null | undefined): string {
   if (!value) return "";
 
-  const digits = value.replace(/\D/g, "").slice(0, 8);
+  const digits = value.replace(/\D/g, "");
 
   if (digits.length <= 5) {

[Killed] StringLiteral
src/utils/formatters.ts:42:39
 export function formatCep(value: string | null | undefined): string {
   if (!value) return "";
 
-  const digits = value.replace(/\D/g, "").slice(0, 8);
+  const digits = value.replace(/\D/g, "Stryker was here!").slice(0, 8);
 
   if (digits.length <= 5) {
killedBy: CartPage aplica cupom e calcula frete
statusReason: Unable to find an element with the text: Limeira/SP. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="min-h-screen bg-[#FAFAF9] px-4 py-10 lg:px-8"
    >

[Killed] EqualityOperator
src/utils/formatters.ts:44:7
 
   const digits = value.replace(/\D/g, "").slice(0, 8);
 
-  if (digits.length <= 5) {
+  if (digits.length < 5) {
     return digits;
   }
killedBy: formatters formata CEP
statusReason: expected '13480-' to be '13480' // Object.is equality

[Killed] EqualityOperator
src/utils/formatters.ts:44:7
 
   const digits = value.replace(/\D/g, "").slice(0, 8);
 
-  if (digits.length <= 5) {
+  if (digits.length > 5) {
     return digits;
   }
killedBy: formatters formata CEP
statusReason: expected '13480000' to be '13480-000' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:48:13
     return digits;
   }
 
-  return `${digits.slice(0, 5)}-${digits.slice(5)}`;
+  return `${digits}-${digits.slice(5)}`;
 }
 
killedBy: formatters formata CEP
statusReason: expected '13480000-000' to be '13480-000' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:48:35
     return digits;
   }
 
-  return `${digits.slice(0, 5)}-${digits.slice(5)}`;
+  return `${digits.slice(0, 5)}-${digits}`;
 }
 
killedBy: formatters formata CEP
statusReason: expected '13480-13480000' to be '13480-000' // Object.is equality

[Killed] BlockStatement
src/utils/formatters.ts:51:69
   return `${digits.slice(0, 5)}-${digits.slice(5)}`;
 }
 
-export function formatCpf(value: string | null | undefined): string {
-  if (!value) return "";
-
-  const digits = value.replace(/\D/g, "").slice(0, 11);
-
-  if (digits.length <= 3) return digits;
-  if (digits.length <= 6) return `${digits.slice(0, 3)}.${digits.slice(3)}`;
-  if (digits.length <= 9) {
-    return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(6)}`;
-  }
-
-  return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(
-    6,
-    9
-  )}-${digits.slice(9)}`;
-}
+export function formatCpf(value: string | null | undefined): string {}
 
 export function formatPhone(value: string | null | undefined): string {
killedBy: formatters formata CPF progressivamente
statusReason: expected undefined to be '123' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:52:7
 }
 
 export function formatCpf(value: string | null | undefined): string {
-  if (!value) return "";
+  if (true) return "";
 
   const digits = value.replace(/\D/g, "").slice(0, 11);
killedBy: formatters formata CPF progressivamente
statusReason: expected '' to be '123' // Object.is equality

[Killed] BooleanLiteral
src/utils/formatters.ts:52:7
 }
 
 export function formatCpf(value: string | null | undefined): string {
-  if (!value) return "";
+  if (value) return "";
 
   const digits = value.replace(/\D/g, "").slice(0, 11);
killedBy: formatters formata CPF progressivamente
statusReason: expected '' to be '123' // Object.is equality

[Survived] MethodExpression
src/utils/formatters.ts:54:18
 export function formatCpf(value: string | null | undefined): string {
   if (!value) return "";
 
-  const digits = value.replace(/\D/g, "").slice(0, 11);
+  const digits = value.replace(/\D/g, "");
 
   if (digits.length <= 3) return digits;

[Killed] ConditionalExpression
src/utils/formatters.ts:56:7
 
   const digits = value.replace(/\D/g, "").slice(0, 11);
 
-  if (digits.length <= 3) return digits;
+  if (false) return digits;
   if (digits.length <= 6) return `${digits.slice(0, 3)}.${digits.slice(3)}`;
   if (digits.length <= 9) {
killedBy: formatters formata CPF progressivamente
statusReason: expected '123.' to be '123' // Object.is equality

[Killed] EqualityOperator
src/utils/formatters.ts:56:7
 
   const digits = value.replace(/\D/g, "").slice(0, 11);
 
-  if (digits.length <= 3) return digits;
+  if (digits.length > 3) return digits;
   if (digits.length <= 6) return `${digits.slice(0, 3)}.${digits.slice(3)}`;
   if (digits.length <= 9) {
killedBy: formatters formata CPF progressivamente
statusReason: expected '123.' to be '123' // Object.is equality

[Killed] EqualityOperator
src/utils/formatters.ts:57:7
   const digits = value.replace(/\D/g, "").slice(0, 11);
 
   if (digits.length <= 3) return digits;
-  if (digits.length <= 6) return `${digits.slice(0, 3)}.${digits.slice(3)}`;
+  if (digits.length > 6) return `${digits.slice(0, 3)}.${digits.slice(3)}`;
   if (digits.length <= 9) {
     return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(6)}`;
killedBy: formatters formata CPF progressivamente
statusReason: expected '123.456.' to be '123.456' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:57:37
   const digits = value.replace(/\D/g, "").slice(0, 11);
 
   if (digits.length <= 3) return digits;
-  if (digits.length <= 6) return `${digits.slice(0, 3)}.${digits.slice(3)}`;
+  if (digits.length <= 6) return `${digits}.${digits.slice(3)}`;
   if (digits.length <= 9) {
     return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(6)}`;
killedBy: formatters formata CPF progressivamente
statusReason: expected '123456.456' to be '123.456' // Object.is equality

[Killed] BlockStatement
src/utils/formatters.ts:58:27
 
   if (digits.length <= 3) return digits;
   if (digits.length <= 6) return `${digits.slice(0, 3)}.${digits.slice(3)}`;
-  if (digits.length <= 9) {
-    return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(6)}`;
-  }
+  if (digits.length <= 9) {}
 
   return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(
killedBy: formatters formata CPF progressivamente
statusReason: expected '123.456.789-' to be '123.456.789' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:58:7
 
   if (digits.length <= 3) return digits;
   if (digits.length <= 6) return `${digits.slice(0, 3)}.${digits.slice(3)}`;
-  if (digits.length <= 9) {
+  if (true) {
     return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(6)}`;
   }
killedBy: formatters formata CPF progressivamente
statusReason: expected '123.456.78909' to be '123.456.789-09' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:59:15
   if (digits.length <= 3) return digits;
   if (digits.length <= 6) return `${digits.slice(0, 3)}.${digits.slice(3)}`;
   if (digits.length <= 9) {
-    return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(6)}`;
+    return `${digits}.${digits.slice(3, 6)}.${digits.slice(6)}`;
   }
 
killedBy: formatters formata CPF progressivamente
statusReason: expected '123456789.456.789' to be '123.456.789' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:59:37
   if (digits.length <= 3) return digits;
   if (digits.length <= 6) return `${digits.slice(0, 3)}.${digits.slice(3)}`;
   if (digits.length <= 9) {
-    return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(6)}`;
+    return `${digits.slice(0, 3)}.${digits}.${digits.slice(6)}`;
   }
 
killedBy: formatters formata CPF progressivamente
statusReason: expected '123.123456789.789' to be '123.456.789' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:62:13
     return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(6)}`;
   }
 
-  return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(
+  return `${digits}.${digits.slice(3, 6)}.${digits.slice(
     6,
     9
killedBy: formatters formata CPF progressivamente
statusReason: expected '12345678909.456.789-09' to be '123.456.789-09' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:62:35
     return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(6)}`;
   }
 
-  return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(
+  return `${digits.slice(0, 3)}.${digits}.${digits.slice(
     6,
     9
killedBy: formatters formata CPF progressivamente
statusReason: expected '123.12345678909.789-09' to be '123.456.789-09' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:65:8
   return `${digits.slice(0, 3)}.${digits.slice(3, 6)}.${digits.slice(
     6,
     9
-  )}-${digits.slice(9)}`;
+  )}-${digits}`;
 }
 
killedBy: formatters formata CPF progressivamente
statusReason: expected '123.456.789-12345678909' to be '123.456.789-09' // Object.is equality

[Killed] BlockStatement
src/utils/formatters.ts:68:71
   )}-${digits.slice(9)}`;
 }
 
-export function formatPhone(value: string | null | undefined): string {
-  if (!value) return "";
-
-  const digits = value.replace(/\D/g, "").slice(0, 11);
-
-  if (digits.length <= 2) return digits;
-  if (digits.length <= 6) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
-  if (digits.length <= 10) {
-    return `(${digits.slice(0, 2)}) ${digits.slice(2, 6)}-${digits.slice(6)}`;
-  }
-
-  return `(${digits.slice(0, 2)}) ${digits.slice(2, 7)}-${digits.slice(7)}`;
-}
+export function formatPhone(value: string | null | undefined): string {}
 
 export function onlyDigits(value: string): string {
killedBy: formatters formata telefone fixo/celular
statusReason: expected undefined to be '(19) 99999-9999' // Object.is equality

[Killed] BooleanLiteral
src/utils/formatters.ts:69:7
 }
 
 export function formatPhone(value: string | null | undefined): string {
-  if (!value) return "";
+  if (value) return "";
 
   const digits = value.replace(/\D/g, "").slice(0, 11);
killedBy: formatters formata telefone fixo/celular
statusReason: expected '' to be '(19) 99999-9999' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:69:7
 }
 
 export function formatPhone(value: string | null | undefined): string {
-  if (!value) return "";
+  if (true) return "";
 
   const digits = value.replace(/\D/g, "").slice(0, 11);
killedBy: formatters formata telefone fixo/celular
statusReason: expected '' to be '(19) 99999-9999' // Object.is equality

[Killed] EqualityOperator
src/utils/formatters.ts:73:7
 
   const digits = value.replace(/\D/g, "").slice(0, 11);
 
-  if (digits.length <= 2) return digits;
+  if (digits.length > 2) return digits;
   if (digits.length <= 6) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
   if (digits.length <= 10) {
killedBy: MyAccountPage renderiza dados da conta do usuário
statusReason: Unable to find an element with the display value: (19) 99999-9999.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="min-h-screen bg-[#FAFAF9] px-4 py-10 lg:px-8"
    >

[Killed] ConditionalExpression
src/utils/formatters.ts:73:7
 
   const digits = value.replace(/\D/g, "").slice(0, 11);
 
-  if (digits.length <= 2) return digits;
+  if (true) return digits;
   if (digits.length <= 6) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
   if (digits.length <= 10) {
killedBy: MyAccountPage renderiza dados da conta do usuário
statusReason: Unable to find an element with the display value: (19) 99999-9999.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="min-h-screen bg-[#FAFAF9] px-4 py-10 lg:px-8"
    >

[Killed] ConditionalExpression
src/utils/formatters.ts:74:7
   const digits = value.replace(/\D/g, "").slice(0, 11);
 
   if (digits.length <= 2) return digits;
-  if (digits.length <= 6) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
+  if (true) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
   if (digits.length <= 10) {
     return `(${digits.slice(0, 2)}) ${digits.slice(2, 6)}-${digits.slice(6)}`;
killedBy: MyAccountPage renderiza dados da conta do usuário
statusReason: Unable to find an element with the display value: (19) 99999-9999.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="min-h-screen bg-[#FAFAF9] px-4 py-10 lg:px-8"
    >

[Killed] EqualityOperator
src/utils/formatters.ts:74:7
   const digits = value.replace(/\D/g, "").slice(0, 11);
 
   if (digits.length <= 2) return digits;
-  if (digits.length <= 6) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
+  if (digits.length > 6) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
   if (digits.length <= 10) {
     return `(${digits.slice(0, 2)}) ${digits.slice(2, 6)}-${digits.slice(6)}`;
killedBy: MyAccountPage renderiza dados da conta do usuário
statusReason: Unable to find an element with the display value: (19) 99999-9999.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="min-h-screen bg-[#FAFAF9] px-4 py-10 lg:px-8"
    >

[Killed] ConditionalExpression
src/utils/formatters.ts:75:7
 
   if (digits.length <= 2) return digits;
   if (digits.length <= 6) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
-  if (digits.length <= 10) {
+  if (false) {
     return `(${digits.slice(0, 2)}) ${digits.slice(2, 6)}-${digits.slice(6)}`;
   }
killedBy: formatters formata telefone fixo/celular
statusReason: expected '(19) 33334-444' to be '(19) 3333-4444' // Object.is equality

[Killed] EqualityOperator
src/utils/formatters.ts:75:7
 
   if (digits.length <= 2) return digits;
   if (digits.length <= 6) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
-  if (digits.length <= 10) {
+  if (digits.length > 10) {
     return `(${digits.slice(0, 2)}) ${digits.slice(2, 6)}-${digits.slice(6)}`;
   }
killedBy: formatters formata telefone fixo/celular
statusReason: expected '(19) 9999-99999' to be '(19) 99999-9999' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:76:16
   if (digits.length <= 2) return digits;
   if (digits.length <= 6) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
   if (digits.length <= 10) {
-    return `(${digits.slice(0, 2)}) ${digits.slice(2, 6)}-${digits.slice(6)}`;
+    return `(${digits}) ${digits.slice(2, 6)}-${digits.slice(6)}`;
   }
 
killedBy: formatters formata telefone fixo/celular
statusReason: expected '(1933334444) 3333-4444' to be '(19) 3333-4444' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:76:39
   if (digits.length <= 2) return digits;
   if (digits.length <= 6) return `(${digits.slice(0, 2)}) ${digits.slice(2)}`;
   if (digits.length <= 10) {
-    return `(${digits.slice(0, 2)}) ${digits.slice(2, 6)}-${digits.slice(6)}`;
+    return `(${digits.slice(0, 2)}) ${digits}-${digits.slice(6)}`;
   }
 
killedBy: formatters formata telefone fixo/celular
statusReason: expected '(19) 1933334444-4444' to be '(19) 3333-4444' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:79:14
     return `(${digits.slice(0, 2)}) ${digits.slice(2, 6)}-${digits.slice(6)}`;
   }
 
-  return `(${digits.slice(0, 2)}) ${digits.slice(2, 7)}-${digits.slice(7)}`;
+  return `(${digits}) ${digits.slice(2, 7)}-${digits.slice(7)}`;
 }
 
killedBy: formatters formata telefone fixo/celular
statusReason: expected '(19999999999) 99999-9999' to be '(19) 99999-9999' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:79:37
     return `(${digits.slice(0, 2)}) ${digits.slice(2, 6)}-${digits.slice(6)}`;
   }
 
-  return `(${digits.slice(0, 2)}) ${digits.slice(2, 7)}-${digits.slice(7)}`;
+  return `(${digits.slice(0, 2)}) ${digits}-${digits.slice(7)}`;
 }
 
killedBy: formatters formata telefone fixo/celular
statusReason: expected '(19) 19999999999-9999' to be '(19) 99999-9999' // Object.is equality

[Killed] BlockStatement
src/utils/formatters.ts:82:51
   return `(${digits.slice(0, 2)}) ${digits.slice(2, 7)}-${digits.slice(7)}`;
 }
 
-export function onlyDigits(value: string): string {
-  return value.replace(/\D/g, "");
-}
+export function onlyDigits(value: string): string {}
 
 export function normalizeNullableText(value: string): string | null {
killedBy: formatters mantém somente dígitos
statusReason: expected undefined to be '19999999999' // Object.is equality

[Killed] BlockStatement
src/utils/formatters.ts:86:69
   return value.replace(/\D/g, "");
 }
 
-export function normalizeNullableText(value: string): string | null {
-  const trimmed = value.trim();
-
-  return trimmed.length > 0 ? trimmed : null;
-}
+export function normalizeNullableText(value: string): string | null {}
 
 export function getInitials(name: string | null | undefined): string {
killedBy: formatters normaliza texto opcional
statusReason: expected undefined to be 'teste' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:87:19
 }
 
 export function normalizeNullableText(value: string): string | null {
-  const trimmed = value.trim();
+  const trimmed = value;
 
   return trimmed.length > 0 ? trimmed : null;
killedBy: formatters normaliza texto opcional
statusReason: expected '  teste  ' to be 'teste' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:89:10
 export function normalizeNullableText(value: string): string | null {
   const trimmed = value.trim();
 
-  return trimmed.length > 0 ? trimmed : null;
+  return false ? trimmed : null;
 }
 
killedBy: formatters normaliza texto opcional
statusReason: expected null to be 'teste' // Object.is equality

[Killed] EqualityOperator
src/utils/formatters.ts:89:10
 export function normalizeNullableText(value: string): string | null {
   const trimmed = value.trim();
 
-  return trimmed.length > 0 ? trimmed : null;
+  return trimmed.length >= 0 ? trimmed : null;
 }
 
killedBy: formatters normaliza texto opcional
statusReason: expected '' to be null

[Killed] BlockStatement
src/utils/formatters.ts:92:70
   return trimmed.length > 0 ? trimmed : null;
 }
 
-export function getInitials(name: string | null | undefined): string {
-  if (!name) return "PC";
-
-  const parts = name
-    .trim()
-    .split(/\s+/)
-    .filter(Boolean);
-
-  if (parts.length === 0) return "PC";
-
-  if (parts.length === 1) {
-    return parts[0].slice(0, 2).toUpperCase();
-  }
-
-  return `${parts[0][0]}${parts[parts.length - 1][0]}`.toUpperCase();
-}
+export function getInitials(name: string | null | undefined): string {}
 
 export function pluralize(
killedBy: formatters gera iniciais
statusReason: expected undefined to be 'ED' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:93:7
 }
 
 export function getInitials(name: string | null | undefined): string {
-  if (!name) return "PC";
+  if (false) return "PC";
 
   const parts = name
killedBy: Header renderiza identidade, busca e ações para visitante
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] BooleanLiteral
src/utils/formatters.ts:93:7
 }
 
 export function getInitials(name: string | null | undefined): string {
-  if (!name) return "PC";
+  if (name) return "PC";
 
   const parts = name
killedBy: formatters gera iniciais
statusReason: expected 'PC' to be 'ED' // Object.is equality

[Survived] MethodExpression
src/utils/formatters.ts:95:17
 export function getInitials(name: string | null | undefined): string {
   if (!name) return "PC";
 
-  const parts = name
-    .trim()
-    .split(/\s+/)
-    .filter(Boolean);
+  const parts = name.trim().split(/\s+/);
 
   if (parts.length === 0) return "PC";

[Survived] MethodExpression
src/utils/formatters.ts:95:17
 export function getInitials(name: string | null | undefined): string {
   if (!name) return "PC";
 
-  const parts = name
-    .trim()
+  const parts = name
     .split(/\s+/)
     .filter(Boolean);

[Killed] EqualityOperator
src/utils/formatters.ts:100:7
     .split(/\s+/)
     .filter(Boolean);
 
-  if (parts.length === 0) return "PC";
+  if (parts.length !== 0) return "PC";
 
   if (parts.length === 1) {
killedBy: formatters gera iniciais
statusReason: expected 'PC' to be 'ED' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:100:7
     .split(/\s+/)
     .filter(Boolean);
 
-  if (parts.length === 0) return "PC";
+  if (true) return "PC";
 
   if (parts.length === 1) {
killedBy: formatters gera iniciais
statusReason: expected 'PC' to be 'ED' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:102:7
 
   if (parts.length === 0) return "PC";
 
-  if (parts.length === 1) {
+  if (true) {
     return parts[0].slice(0, 2).toUpperCase();
   }
killedBy: formatters gera iniciais
statusReason: expected 'EV' to be 'ED' // Object.is equality

[Killed] EqualityOperator
src/utils/formatters.ts:102:7
 
   if (parts.length === 0) return "PC";
 
-  if (parts.length === 1) {
+  if (parts.length !== 1) {
     return parts[0].slice(0, 2).toUpperCase();
   }
killedBy: formatters gera iniciais
statusReason: expected 'EV' to be 'ED' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:103:12
   if (parts.length === 0) return "PC";
 
   if (parts.length === 1) {
-    return parts[0].slice(0, 2).toUpperCase();
+    return parts[0].slice(0, 2).toLowerCase();
   }
 
killedBy: formatters gera iniciais
statusReason: expected 'po' to be 'PO' // Object.is equality

[Killed] MethodExpression
src/utils/formatters.ts:103:12
   if (parts.length === 0) return "PC";
 
   if (parts.length === 1) {
-    return parts[0].slice(0, 2).toUpperCase();
+    return parts[0].toUpperCase();
   }
 
killedBy: formatters gera iniciais
statusReason: expected 'POINTCLICK' to be 'PO' // Object.is equality

[Killed] ArithmeticOperator
src/utils/formatters.ts:106:33
     return parts[0].slice(0, 2).toUpperCase();
   }
 
-  return `${parts[0][0]}${parts[parts.length - 1][0]}`.toUpperCase();
+  return `${parts[0][0]}${parts[parts.length + 1][0]}`.toUpperCase();
 }
 
killedBy: formatters gera iniciais
statusReason: Cannot read properties of undefined (reading '0')

[Killed] MethodExpression
src/utils/formatters.ts:106:10
     return parts[0].slice(0, 2).toUpperCase();
   }
 
-  return `${parts[0][0]}${parts[parts.length - 1][0]}`.toUpperCase();
+  return `${parts[0][0]}${parts[parts.length - 1][0]}`.toLowerCase();
 }
 
killedBy: formatters gera iniciais
statusReason: expected 'ed' to be 'ED' // Object.is equality
