[Killed] BlockStatement
src/utils/formatters.ts:113:11
   count: number,
   singular: string,
   plural: string
-): string {
-  return count === 1 ? singular : plural;
-}
+): string {}
killedBy: formatters pluraliza termos
statusReason: expected undefined to be 'produto' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:114:10
   singular: string,
   plural: string
 ): string {
-  return count === 1 ? singular : plural;
+  return true ? singular : plural;
 }
killedBy: formatters pluraliza termos
statusReason: expected 'produto' to be 'produtos' // Object.is equality

[Killed] ConditionalExpression
src/utils/formatters.ts:114:10
   singular: string,
   plural: string
 ): string {
-  return count === 1 ? singular : plural;
+  return false ? singular : plural;
 }
killedBy: formatters pluraliza termos
statusReason: expected 'produtos' to be 'produto' // Object.is equality
