[Killed] BlockStatement
src/utils/shippingCepStorage.ts:3:71
 export const SHIPPING_CEP_STORAGE_KEY = "pointclick_shipping_cep";
 
-export function sanitizeCep(value: string | null | undefined): string {
-  return value?.replace(/\D/g, "").slice(0, 8) ?? "";
-}
+export function sanitizeCep(value: string | null | undefined): string {}
 
 export function formatCepInput(value: string): string {
killedBy: CartPage mostra carrinho vazio quando não há itens
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/utils/shippingCepStorage.ts:4:10
 export const SHIPPING_CEP_STORAGE_KEY = "pointclick_shipping_cep";
 
 export function sanitizeCep(value: string | null | undefined): string {
-  return value?.replace(/\D/g, "").slice(0, 8) ?? "";
+  return value?.replace(/\D/g, "") ?? "";
 }
 
killedBy: shippingCepStorage sanitiza CEP mantendo no máximo 8 dígitos
statusReason: expected '13480000123' to be '13480000' // Object.is equality

[Killed] OptionalChaining
src/utils/shippingCepStorage.ts:4:10
 export const SHIPPING_CEP_STORAGE_KEY = "pointclick_shipping_cep";
 
 export function sanitizeCep(value: string | null | undefined): string {
-  return value?.replace(/\D/g, "").slice(0, 8) ?? "";
+  return value.replace(/\D/g, "").slice(0, 8) ?? "";
 }
 
killedBy: ProductDetailsPage redireciona para login ao favoritar sem autenticação
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/utils/shippingCepStorage.ts:7:55
   return value?.replace(/\D/g, "").slice(0, 8) ?? "";
 }
 
-export function formatCepInput(value: string): string {
-  const digits = sanitizeCep(value);
-
-  if (digits.length <= 5) {
-    return digits;
-  }
-
-  return `${digits.slice(0, 5)}-${digits.slice(5)}`;
-}
+export function formatCepInput(value: string): string {}
 
 export function getStoredShippingCep(): string {
killedBy: shippingCepStorage formata entrada de CEP
statusReason: expected undefined to be '1348' // Object.is equality

[Killed] BlockStatement
src/utils/shippingCepStorage.ts:10:27
 export function formatCepInput(value: string): string {
   const digits = sanitizeCep(value);
 
-  if (digits.length <= 5) {
-    return digits;
-  }
+  if (digits.length <= 5) {}
 
   return `${digits.slice(0, 5)}-${digits.slice(5)}`;
killedBy: shippingCepStorage formata entrada de CEP
statusReason: expected '1348-' to be '1348' // Object.is equality

[Killed] ConditionalExpression
src/utils/shippingCepStorage.ts:10:7
 export function formatCepInput(value: string): string {
   const digits = sanitizeCep(value);
 
-  if (digits.length <= 5) {
+  if (true) {
     return digits;
   }
killedBy: shippingCepStorage formata entrada de CEP
statusReason: expected '13480000' to be '13480-000' // Object.is equality

[Killed] BlockStatement
src/utils/shippingCepStorage.ts:17:48
   return `${digits.slice(0, 5)}-${digits.slice(5)}`;
 }
 
-export function getStoredShippingCep(): string {
-  if (typeof window === "undefined") return "";
-
-  try {
-    return sanitizeCep(sessionStorage.getItem(SHIPPING_CEP_STORAGE_KEY));
-  } catch {
-    return "";
-  }
-}
+export function getStoredShippingCep(): string {}
 
 export function saveStoredShippingCep(cep: string): void {
killedBy: ProductDetailsPage redireciona para login ao favoritar sem autenticação
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/utils/shippingCepStorage.ts:18:7
 }
 
 export function getStoredShippingCep(): string {
-  if (typeof window === "undefined") return "";
+  if (typeof window !== "undefined") return "";
 
   try {
killedBy: shippingCepStorage salva e recupera CEP válido do sessionStorage
statusReason: expected '' to be '13480000' // Object.is equality

[Killed] ConditionalExpression
src/utils/shippingCepStorage.ts:18:7
 }
 
 export function getStoredShippingCep(): string {
-  if (typeof window === "undefined") return "";
+  if (true) return "";
 
   try {
killedBy: shippingCepStorage salva e recupera CEP válido do sessionStorage
statusReason: expected '' to be '13480000' // Object.is equality

[Killed] BlockStatement
src/utils/shippingCepStorage.ts:20:7
 export function getStoredShippingCep(): string {
   if (typeof window === "undefined") return "";
 
-  try {
-    return sanitizeCep(sessionStorage.getItem(SHIPPING_CEP_STORAGE_KEY));
-  } catch {
+  try {} catch {
     return "";
   }
killedBy: ProductDetailsPage redireciona para login ao favoritar sem autenticação
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] BlockStatement
src/utils/shippingCepStorage.ts:22:11
 
   try {
     return sanitizeCep(sessionStorage.getItem(SHIPPING_CEP_STORAGE_KEY));
-  } catch {
-    return "";
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/utils/shippingCepStorage.ts:27:58
   }
 }
 
-export function saveStoredShippingCep(cep: string): void {
-  if (typeof window === "undefined") return;
-
-  const sanitizedCep = sanitizeCep(cep);
-
-  if (sanitizedCep.length !== 8) return;
-
-  try {
-    sessionStorage.setItem(SHIPPING_CEP_STORAGE_KEY, sanitizedCep);
-  } catch {
-    // Não bloqueia o fluxo caso o navegador negue acesso ao sessionStorage.
-  }
-}
+export function saveStoredShippingCep(cep: string): void {}
 
killedBy: shippingCepStorage salva e recupera CEP válido do sessionStorage
statusReason: expected null to be '13480000' // Object.is equality

[Killed] ConditionalExpression
src/utils/shippingCepStorage.ts:28:7
 }
 
 export function saveStoredShippingCep(cep: string): void {
-  if (typeof window === "undefined") return;
+  if (true) return;
 
   const sanitizedCep = sanitizeCep(cep);
killedBy: shippingCepStorage salva e recupera CEP válido do sessionStorage
statusReason: expected null to be '13480000' // Object.is equality

[Killed] EqualityOperator
src/utils/shippingCepStorage.ts:28:7
 }
 
 export function saveStoredShippingCep(cep: string): void {
-  if (typeof window === "undefined") return;
+  if (typeof window !== "undefined") return;
 
   const sanitizedCep = sanitizeCep(cep);
killedBy: shippingCepStorage salva e recupera CEP válido do sessionStorage
statusReason: expected null to be '13480000' // Object.is equality

[Killed] ConditionalExpression
src/utils/shippingCepStorage.ts:32:7
 
   const sanitizedCep = sanitizeCep(cep);
 
-  if (sanitizedCep.length !== 8) return;
+  if (true) return;
 
   try {
killedBy: shippingCepStorage salva e recupera CEP válido do sessionStorage
statusReason: expected null to be '13480000' // Object.is equality

[Killed] EqualityOperator
src/utils/shippingCepStorage.ts:32:7
 
   const sanitizedCep = sanitizeCep(cep);
 
-  if (sanitizedCep.length !== 8) return;
+  if (sanitizedCep.length === 8) return;
 
   try {
killedBy: shippingCepStorage salva e recupera CEP válido do sessionStorage
statusReason: expected null to be '13480000' // Object.is equality

[Killed] BlockStatement
src/utils/shippingCepStorage.ts:34:7
 
   if (sanitizedCep.length !== 8) return;
 
-  try {
-    sessionStorage.setItem(SHIPPING_CEP_STORAGE_KEY, sanitizedCep);
-  } catch {
+  try {} catch {
     // Não bloqueia o fluxo caso o navegador negue acesso ao sessionStorage.
   }
killedBy: shippingCepStorage salva e recupera CEP válido do sessionStorage
statusReason: expected null to be '13480000' // Object.is equality
