[Killed] BlockStatement
src/services/orderService.ts:15:69
 import { apiFetch, buildQueryParams } from "./api";
 
 export const orderService = {
-  async create(request: CreateOrderRequest): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>("/orders", {
-      method: "POST",
-      body: request,
-    });
-  },
+  async create(request: CreateOrderRequest): Promise<OrderResponse> {},
 
   async findCurrentCart(): Promise<OrderResponse | null> {
killedBy: orderService cria pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders', { method: 'POST', …(1) } ]

Number of calls: 0

[Killed] BlockStatement
src/services/orderService.ts:22:58
     });
   },
 
-  async findCurrentCart(): Promise<OrderResponse | null> {
-    try {
-      return await apiFetch<OrderResponse>("/orders/current", {
-        method: "GET",
-      });
-    } catch (error) {
-      if (
-        error instanceof Error &&
-        "status" in error &&
-        (error as { status?: number }).status === 204
-      ) {
-        return null;
-      }
-
-      throw error;
-    }
-  },
+  async findCurrentCart(): Promise<OrderResponse | null> {},
 
   async findMyOrders(): Promise<OrderSummaryResponse[]> {
killedBy: orderService retorna carrinho atual
statusReason: expected undefined to deeply equal { id: 10, userId: 1, …(21) }

[Killed] BlockStatement
src/services/orderService.ts:23:9
   },
 
   async findCurrentCart(): Promise<OrderResponse | null> {
-    try {
-      return await apiFetch<OrderResponse>("/orders/current", {
-        method: "GET",
-      });
-    } catch (error) {
+    try {} catch (error) {
       if (
         error instanceof Error &&
killedBy: orderService retorna carrinho atual
statusReason: expected undefined to deeply equal { id: 10, userId: 1, …(21) }

[Killed] BlockStatement
src/services/orderService.ts:27:21
       return await apiFetch<OrderResponse>("/orders/current", {
         method: "GET",
       });
-    } catch (error) {
-      if (
-        error instanceof Error &&
-        "status" in error &&
-        (error as { status?: number }).status === 204
-      ) {
-        return null;
-      }
-
-      throw error;
-    }
+    } catch (error) {}
   },
 
killedBy: orderService retorna null quando carrinho atual responde 204
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/services/orderService.ts:29:9
       });
     } catch (error) {
       if (
-        error instanceof Error &&
-        "status" in error &&
-        (error as { status?: number }).status === 204
+        false
       ) {
         return null;
killedBy: orderService retorna null quando carrinho atual responde 204
statusReason: promise rejected "Error: No content { status: 204 }" instead of resolving

[Survived] LogicalOperator
src/services/orderService.ts:29:9
       });
     } catch (error) {
       if (
-        error instanceof Error &&
-        "status" in error &&
+        error instanceof Error || "status" in error &&
         (error as { status?: number }).status === 204
       ) {

[Killed] StringLiteral
src/services/orderService.ts:30:9
     } catch (error) {
       if (
         error instanceof Error &&
-        "status" in error &&
+        "" in error &&
         (error as { status?: number }).status === 204
       ) {
killedBy: orderService retorna null quando carrinho atual responde 204
statusReason: promise rejected "Error: No content { status: 204 }" instead of resolving

[Killed] EqualityOperator
src/services/orderService.ts:31:9
       if (
         error instanceof Error &&
         "status" in error &&
-        (error as { status?: number }).status === 204
+        (error as {
+  status?: number;
+}).status !== 204
       ) {
         return null;
killedBy: orderService retorna null quando carrinho atual responde 204
statusReason: promise rejected "Error: No content { status: 204 }" instead of resolving

[Survived] ConditionalExpression
src/services/orderService.ts:31:9
       if (
         error instanceof Error &&
         "status" in error &&
-        (error as { status?: number }).status === 204
+        true
       ) {
         return null;

[Killed] BlockStatement
src/services/orderService.ts:32:9
         error instanceof Error &&
         "status" in error &&
         (error as { status?: number }).status === 204
-      ) {
-        return null;
-      }
+      ) {}
 
       throw error;
killedBy: orderService retorna null quando carrinho atual responde 204
statusReason: promise rejected "Error: No content { status: 204 }" instead of resolving

[Killed] BlockStatement
src/services/orderService.ts:40:57
     }
   },
 
-  async findMyOrders(): Promise<OrderSummaryResponse[]> {
-    return apiFetch<OrderSummaryResponse[]>("/orders/my", {
-      method: "GET",
-    });
-  },
+  async findMyOrders(): Promise<OrderSummaryResponse[]> {},
 
   async findAllForAdmin(
killedBy: orderService lista pedidos do cliente e pedidos admin
statusReason: expected 1st "vi.fn()" call to have been called with [ '/orders/my', { method: 'GET' } ]

[Killed] StringLiteral
src/services/orderService.ts:41:45
   },
 
   async findMyOrders(): Promise<OrderSummaryResponse[]> {
-    return apiFetch<OrderSummaryResponse[]>("/orders/my", {
+    return apiFetch<OrderSummaryResponse[]>("", {
       method: "GET",
     });
killedBy: orderService lista pedidos do cliente e pedidos admin
statusReason: expected 1st "vi.fn()" call to have been called with [ '/orders/my', { method: 'GET' } ]

[Killed] BlockStatement
src/services/orderService.ts:48:43
 
   async findAllForAdmin(
     status?: OrderStatus | null
-  ): Promise<AdminOrderSummaryResponse[]> {
-    const query = buildQueryParams({
-      status,
-    });
-
-    return apiFetch<AdminOrderSummaryResponse[]>(`/orders${query}`, {
-      method: "GET",
-    });
-  },
+  ): Promise<AdminOrderSummaryResponse[]> {},
 
   async getStatusSummary(): Promise<OrderStatusSummaryResponse> {
killedBy: orderService lista pedidos do cliente e pedidos admin
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/orders?status=PAID', …(1) ], but called only 1 times

[Killed] StringLiteral
src/services/orderService.ts:53:50
       status,
     });
 
-    return apiFetch<AdminOrderSummaryResponse[]>(`/orders${query}`, {
+    return apiFetch<AdminOrderSummaryResponse[]>(``, {
       method: "GET",
     });
killedBy: orderService lista pedidos do cliente e pedidos admin
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/orders?status=PAID', …(1) ]

[Killed] BlockStatement
src/services/orderService.ts:58:65
     });
   },
 
-  async getStatusSummary(): Promise<OrderStatusSummaryResponse> {
-    return apiFetch<OrderStatusSummaryResponse>("/orders/summary", {
-      method: "GET",
-    });
-  },
+  async getStatusSummary(): Promise<OrderStatusSummaryResponse> {},
 
   async findById(orderId: number): Promise<OrderResponse> {
killedBy: orderService busca resumo por status
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] BlockStatement
src/services/orderService.ts:64:59
     });
   },
 
-  async findById(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}`, {
-      method: "GET",
-    });
-  },
+  async findById(orderId: number): Promise<OrderResponse> {},
 
   async findByIdForAdmin(orderId: number): Promise<OrderResponse> {
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10', { method: 'GET' } ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10",

[Killed] StringLiteral
src/services/orderService.ts:65:36
   },
 
   async findById(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}`, {
+    return apiFetch<OrderResponse>(``, {
       method: "GET",
     });
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10', { method: 'GET' } ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10",

[Killed] StringLiteral
src/services/orderService.ts:66:15
 
   async findById(orderId: number): Promise<OrderResponse> {
     return apiFetch<OrderResponse>(`/orders/${orderId}`, {
-      method: "GET",
+      method: "",
     });
   },
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10', { method: 'GET' } ]

Received:

  1st vi.fn() call:

  [
    "/orders/10",

[Killed] BlockStatement
src/services/orderService.ts:70:67
     });
   },
 
-  async findByIdForAdmin(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/admin/${orderId}`, {
-      method: "GET",
-    });
-  },
+  async findByIdForAdmin(orderId: number): Promise<OrderResponse> {},
 
   async addItem(
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/admin/10', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/admin/10",

[Killed] BlockStatement
src/services/orderService.ts:79:29
   async addItem(
     orderId: number,
     request: AddOrderItemRequest
-  ): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/items`, {
-      method: "POST",
-      body: request,
-    });
-  },
+  ): Promise<OrderResponse> {},
 
   async updateItem(
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/items', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/items",

[Killed] BlockStatement
src/services/orderService.ts:90:29
     orderId: number,
     itemId: number,
     request: UpdateOrderItemRequest
-  ): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/items/${itemId}`, {
-      method: "PUT",
-      body: request,
-    });
-  },
+  ): Promise<OrderResponse> {},
 
   async removeItem(orderId: number, itemId: number): Promise<OrderResponse> {
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/items/100', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/items/100",

[Killed] ObjectLiteral
src/services/orderService.ts:91:74
     itemId: number,
     request: UpdateOrderItemRequest
   ): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/items/${itemId}`, {
-      method: "PUT",
-      body: request,
-    });
+    return apiFetch<OrderResponse>(`/orders/${orderId}/items/${itemId}`, {});
   },
 
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/items/100', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/items/100",

[Killed] StringLiteral
src/services/orderService.ts:91:36
     itemId: number,
     request: UpdateOrderItemRequest
   ): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/items/${itemId}`, {
+    return apiFetch<OrderResponse>(``, {
       method: "PUT",
       body: request,
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/items/100', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/items/100",

[Killed] BlockStatement
src/services/orderService.ts:97:77
     });
   },
 
-  async removeItem(orderId: number, itemId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/items/${itemId}`, {
-      method: "DELETE",
-    });
-  },
+  async removeItem(orderId: number, itemId: number): Promise<OrderResponse> {},
 
   async applyCoupon(
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/items/100', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/items/100",

[Killed] ObjectLiteral
src/services/orderService.ts:98:74
   },
 
   async removeItem(orderId: number, itemId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/items/${itemId}`, {
-      method: "DELETE",
-    });
+    return apiFetch<OrderResponse>(`/orders/${orderId}/items/${itemId}`, {});
   },
 
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/items/100', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/items/100",

[Killed] BlockStatement
src/services/orderService.ts:106:29
   async applyCoupon(
     orderId: number,
     request: ApplyCouponRequest
-  ): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/coupon`, {
-      method: "POST",
-      body: request,
-    });
-  },
+  ): Promise<OrderResponse> {},
 
   async removeCoupon(orderId: number): Promise<OrderResponse> {
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/coupon', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/coupon",

[Killed] StringLiteral
src/services/orderService.ts:108:15
     request: ApplyCouponRequest
   ): Promise<OrderResponse> {
     return apiFetch<OrderResponse>(`/orders/${orderId}/coupon`, {
-      method: "POST",
+      method: "",
       body: request,
     });
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/coupon', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/coupon",

[Killed] BlockStatement
src/services/orderService.ts:113:63
     });
   },
 
-  async removeCoupon(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/coupon`, {
-      method: "DELETE",
-    });
-  },
+  async removeCoupon(orderId: number): Promise<OrderResponse> {},
 
   async close(orderId: number): Promise<OrderResponse> {
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/coupon', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/coupon",

[Killed] BlockStatement
src/services/orderService.ts:119:56
     });
   },
 
-  async close(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/close`, {
-      method: "POST",
-    });
-  },
+  async close(orderId: number): Promise<OrderResponse> {},
 
   async ship(orderId: number): Promise<OrderResponse> {
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/close', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/close",

[Killed] ObjectLiteral
src/services/orderService.ts:120:64
   },
 
   async close(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/close`, {
-      method: "POST",
-    });
+    return apiFetch<OrderResponse>(`/orders/${orderId}/close`, {});
   },
 
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/close', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/close",

[Killed] StringLiteral
src/services/orderService.ts:121:15
 
   async close(orderId: number): Promise<OrderResponse> {
     return apiFetch<OrderResponse>(`/orders/${orderId}/close`, {
-      method: "POST",
+      method: "",
     });
   },
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/close', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/close",

[Killed] BlockStatement
src/services/orderService.ts:125:55
     });
   },
 
-  async ship(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/ship`, {
-      method: "POST",
-    });
-  },
+  async ship(orderId: number): Promise<OrderResponse> {},
 
   async deliver(orderId: number): Promise<OrderResponse> {
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/ship', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/ship",

[Killed] StringLiteral
src/services/orderService.ts:126:36
   },
 
   async ship(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/ship`, {
+    return apiFetch<OrderResponse>(``, {
       method: "POST",
     });
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/ship', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/ship",

[Killed] BlockStatement
src/services/orderService.ts:131:58
     });
   },
 
-  async deliver(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/deliver`, {
-      method: "POST",
-    });
-  },
+  async deliver(orderId: number): Promise<OrderResponse> {},
 
   async confirmDelivery(orderId: number): Promise<OrderResponse> {
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/deliver', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/deliver",

[Killed] StringLiteral
src/services/orderService.ts:132:36
   },
 
   async deliver(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/deliver`, {
+    return apiFetch<OrderResponse>(``, {
       method: "POST",
     });
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/deliver', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/deliver",

[Killed] BlockStatement
src/services/orderService.ts:137:66
     });
   },
 
-  async confirmDelivery(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/confirm-delivery`, {
-      method: "POST",
-    });
-  },
+  async confirmDelivery(orderId: number): Promise<OrderResponse> {},
 
   async finish(orderId: number): Promise<OrderResponse> {
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/confirm-delivery', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/confirm-delivery",

[Killed] StringLiteral
src/services/orderService.ts:139:15
 
   async confirmDelivery(orderId: number): Promise<OrderResponse> {
     return apiFetch<OrderResponse>(`/orders/${orderId}/confirm-delivery`, {
-      method: "POST",
+      method: "",
     });
   },
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/confirm-delivery', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/confirm-delivery",

[Killed] BlockStatement
src/services/orderService.ts:143:57
     });
   },
 
-  async finish(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/finish`, {
-      method: "POST",
-    });
-  },
+  async finish(orderId: number): Promise<OrderResponse> {},
 
   async cancel(orderId: number): Promise<OrderResponse> {
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/finish', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/finish",

[Killed] ObjectLiteral
src/services/orderService.ts:144:65
   },
 
   async finish(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/finish`, {
-      method: "POST",
-    });
+    return apiFetch<OrderResponse>(`/orders/${orderId}/finish`, {});
   },
 
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/finish', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/finish",

[Killed] BlockStatement
src/services/orderService.ts:149:57
     });
   },
 
-  async cancel(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/cancel`, {
-      method: "POST",
-    });
-  },
+  async cancel(orderId: number): Promise<OrderResponse> {},
 
   async reopenExpired(orderId: number): Promise<OrderResponse> {
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/cancel', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/cancel",

[Killed] ObjectLiteral
src/services/orderService.ts:150:65
   },
 
   async cancel(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/cancel`, {
-      method: "POST",
-    });
+    return apiFetch<OrderResponse>(`/orders/${orderId}/cancel`, {});
   },
 
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/cancel', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/cancel",

[Killed] BlockStatement
src/services/orderService.ts:155:64
     });
   },
 
-  async reopenExpired(orderId: number): Promise<OrderResponse> {
-    return apiFetch<OrderResponse>(`/orders/${orderId}/reopen-expired`, {
-      method: "POST",
-    });
-  },
+  async reopenExpired(orderId: number): Promise<OrderResponse> {},
 };
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/reopen-expired', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/reopen-expired",

[Killed] StringLiteral
src/services/orderService.ts:157:15
 
   async reopenExpired(orderId: number): Promise<OrderResponse> {
     return apiFetch<OrderResponse>(`/orders/${orderId}/reopen-expired`, {
-      method: "POST",
+      method: "",
     });
   },
killedBy: orderService executa ações principais do pedido
statusReason: expected "vi.fn()" to be called with arguments: [ '/orders/10/reopen-expired', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "/orders/10/reopen-expired",
