[Killed] BlockStatement
src/services/paymentService.ts:11:31
   async createPayment(
     orderId: number,
     request: CreatePaymentRequest
-  ): Promise<PaymentResponse> {
-    return apiFetch<PaymentResponse>(`/payments/orders/${orderId}`, {
-      method: "POST",
-      body: request,
-    });
-  },
+  ): Promise<PaymentResponse> {},
 
   async findByOrderId(orderId: number): Promise<PaymentResponse> {
killedBy: paymentService cria pagamento
statusReason: expected "vi.fn()" to be called with arguments: [ '/payments/orders/10', …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/services/paymentService.ts:12:38
     orderId: number,
     request: CreatePaymentRequest
   ): Promise<PaymentResponse> {
-    return apiFetch<PaymentResponse>(`/payments/orders/${orderId}`, {
+    return apiFetch<PaymentResponse>(``, {
       method: "POST",
       body: request,
killedBy: paymentService cria pagamento
statusReason: expected "vi.fn()" to be called with arguments: [ '/payments/orders/10', …(1) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] BlockStatement
src/services/paymentService.ts:18:66
     });
   },
 
-  async findByOrderId(orderId: number): Promise<PaymentResponse> {
-    return apiFetch<PaymentResponse>(`/payments/orders/${orderId}`, {
-      method: "GET",
-    });
-  },
+  async findByOrderId(orderId: number): Promise<PaymentResponse> {},
 
   async cancelPayment(paymentId: number): Promise<PaymentResponse> {
killedBy: paymentService busca e cancela pagamento
statusReason: expected 1st "vi.fn()" call to have been called with [ '/payments/orders/10', …(1) ]

[Killed] ObjectLiteral
src/services/paymentService.ts:19:69
   },
 
   async findByOrderId(orderId: number): Promise<PaymentResponse> {
-    return apiFetch<PaymentResponse>(`/payments/orders/${orderId}`, {
-      method: "GET",
-    });
+    return apiFetch<PaymentResponse>(`/payments/orders/${orderId}`, {});
   },
 
killedBy: paymentService busca e cancela pagamento
statusReason: expected 1st "vi.fn()" call to have been called with [ '/payments/orders/10', …(1) ]

[Killed] BlockStatement
src/services/paymentService.ts:24:68
     });
   },
 
-  async cancelPayment(paymentId: number): Promise<PaymentResponse> {
-    return apiFetch<PaymentResponse>(`/payments/${paymentId}/cancel`, {
-      method: "POST",
-    });
-  },
+  async cancelPayment(paymentId: number): Promise<PaymentResponse> {},
 
   async confirmPixPayment(
killedBy: paymentService busca e cancela pagamento
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/payments/1/cancel', …(1) ], but called only 1 times

[Killed] StringLiteral
src/services/paymentService.ts:25:38
   },
 
   async cancelPayment(paymentId: number): Promise<PaymentResponse> {
-    return apiFetch<PaymentResponse>(`/payments/${paymentId}/cancel`, {
+    return apiFetch<PaymentResponse>(``, {
       method: "POST",
     });
killedBy: paymentService busca e cancela pagamento
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/payments/1/cancel', …(1) ]

[Killed] ObjectLiteral
src/services/paymentService.ts:25:71
   },
 
   async cancelPayment(paymentId: number): Promise<PaymentResponse> {
-    return apiFetch<PaymentResponse>(`/payments/${paymentId}/cancel`, {
-      method: "POST",
-    });
+    return apiFetch<PaymentResponse>(`/payments/${paymentId}/cancel`, {});
   },
 
killedBy: paymentService busca e cancela pagamento
statusReason: expected 2nd "vi.fn()" call to have been called with [ '/payments/1/cancel', …(1) ]

[Killed] BlockStatement
src/services/paymentService.ts:33:31
   async confirmPixPayment(
     paymentId: number,
     token: string
-  ): Promise<PaymentResponse> {
-    const encodedToken = encodeURIComponent(token);
-
-    return apiFetch<PaymentResponse>(
-      `/payments/${paymentId}/confirm-pix?token=${encodedToken}`,
-      {
-        method: "POST",
-        auth: false,
-      }
-    );
-  },
+  ): Promise<PaymentResponse> {},
 
   async confirmBankSlipPayment(
killedBy: paymentService confirma PIX e boleto sem autenticação
statusReason: expected 1st "vi.fn()" call to have been called with [ …(2) ]

[Killed] StringLiteral
src/services/paymentService.ts:37:7
     const encodedToken = encodeURIComponent(token);
 
     return apiFetch<PaymentResponse>(
-      `/payments/${paymentId}/confirm-pix?token=${encodedToken}`,
+      ``,
       {
         method: "POST",
killedBy: paymentService confirma PIX e boleto sem autenticação
statusReason: expected 1st "vi.fn()" call to have been called with [ …(2) ]

[Killed] BooleanLiteral
src/services/paymentService.ts:40:15
       `/payments/${paymentId}/confirm-pix?token=${encodedToken}`,
       {
         method: "POST",
-        auth: false,
+        auth: true,
       }
     );
killedBy: paymentService confirma PIX e boleto sem autenticação
statusReason: expected 1st "vi.fn()" call to have been called with [ …(2) ]

[Killed] BlockStatement
src/services/paymentService.ts:48:31
   async confirmBankSlipPayment(
     paymentId: number,
     token: string
-  ): Promise<PaymentResponse> {
-    const encodedToken = encodeURIComponent(token);
-
-    return apiFetch<PaymentResponse>(
-      `/payments/${paymentId}/confirm-bank-slip?token=${encodedToken}`,
-      {
-        method: "POST",
-        auth: false,
-      }
-    );
-  },
+  ): Promise<PaymentResponse> {},
 };
killedBy: paymentService confirma PIX e boleto sem autenticação
statusReason: expected 2nd "vi.fn()" call to have been called with [ …(2) ], but called only 1 times

[Killed] ObjectLiteral
src/services/paymentService.ts:53:7
 
     return apiFetch<PaymentResponse>(
       `/payments/${paymentId}/confirm-bank-slip?token=${encodedToken}`,
-      {
-        method: "POST",
-        auth: false,
-      }
+      {}
     );
   },
killedBy: paymentService confirma PIX e boleto sem autenticação
statusReason: expected 2nd "vi.fn()" call to have been called with [ …(2) ]

[Killed] StringLiteral
src/services/paymentService.ts:54:17
     return apiFetch<PaymentResponse>(
       `/payments/${paymentId}/confirm-bank-slip?token=${encodedToken}`,
       {
-        method: "POST",
+        method: "",
         auth: false,
       }
killedBy: paymentService confirma PIX e boleto sem autenticação
statusReason: expected 2nd "vi.fn()" call to have been called with [ …(2) ]
